#Область Пример
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекстHTML = "";
	Вложение = Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML,Вложение); 
	СтруктураФорматированногоДокумента = Справочники.ШаблоныДоговоров.ПустаяСтруктураШаблонаДоговора();
	СтруктураФорматированногоДокумента.ТекстHTML = ТекстHTML;
	СтруктураФорматированногоДокумента.Вложение = Вложение;
	
	ТекущийОбъект.ШаблонХранилище = Новый ХранилищеЗначения(СтруктураФорматированногоДокумента, Новый СжатиеДанных(9));
КонецПроцедуры	
#КонецОбласти

