//Шаг №1  +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МакетИгровогоПоля = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетПоля");
	ОсновноеПолеИгры.Вывести(МакетИгровогоПоля);	
КонецПроцедуры
// Шаг№1 ---
&НаКлиенте
Процедура ДобавитьЯблоко()
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ГСЧ_Х = ГСЧ.СлучайноеЧисло(1,20);
	ГСЧ_У = ГСЧ.СлучайноеЧисло(1,20);
	ЕдаХ = ГСЧ_Х;
	ЕдаУ = ГСЧ_У;
	Область = ОсновноеПолеИгры.Область(ЕдаХ,ЕдаУ);
	Область.ЦветФона = Новый Цвет(255,0,0);
КонецПроцедуры	
&НаКлиенте
Процедура УдалитьЯблоко()
	 Область = ОсновноеПолеИгры.Область(ЕдаХ,ЕдаУ);
	 Область.ЦветФона = Новый Цвет(244,236,197);
	 ЕдаХ = 0;
	 ЕдаУ = 0;
КонецПроцедуры	
//Шаг17+++
&НаКлиенте
Процедура УдалитьПитона()
	Для Каждого Точкаитона из Питон Цикл
		Область = ОсновноеПолеИгры.Область(ЕдаХ,ЕдаУ);
	 	Область.ЦветФона = Новый Цвет(244,236,197);	
	КонецЦикла;	
	Питон.Очистить();
КонецПроцедуры
//Шаг17---

// Шаг№2 +++
&НаКлиенте
Процедура ЗапускИгры(Команда)
	 СкоростьИгры = 0; // шаг 8
	 КонецИгры = Ложь;
	 //Шаг 16+++
	 УдалитьЯблоко();
	 //Шаг 16---
	 УдалитьПитона();
	 АктивироватьПитона();
	 ОтображениеПитонаНаИгравомПоле();
	 // шаг8+++
	 ПодключитьОбработчикОжидания("Игра",1-СкоростьИгры*0.1,Истина);
	 // шаг8---
	 //Шаг 15 +++
	 ДобавитьЯблоко();
	 //Шаг 15 ---
КонецПроцедуры
// Шаг№2---

// Шаг№3+++
&НаКлиенте
Процедура АктивироватьПитона()
	Питон.Очистить();
	Точка = Питон.Добавить();
	Точка.Х = 10;
	Точка.У = 10;
	Точка = Питон.Добавить();
	Точка.Х = 11;
	Точка.У = 10;
	Точка = Питон.Добавить();
	Точка.Х = 12;
	Точка.У = 10;
КонецПроцедуры	
// Шаг№3---

//Шаг 20+++
&НаКлиенте
Процедура УвеличитьСкорость()
	Если СкоростьИгры <9 Тогда
		СкоростьИгры = СкоростьИгры + 1;
	КонецЕсли;
КонецПроцедуры	
//Шаг20---

// шаг 14+++
&НаКлиенте
Процедура ДвижениеПоОсям(ДлинаПитона,СмещениеХ,СмещениеУ)
	ПоследнийИндекс = ДлинаПитона -1;
	ТочкаНачальныйИндекс = Питон[0];
    Питон.Удалить(ПоследнийИндекс);
	НоваяТочка = Питон.Вставить(0);
    НоваяТочка.Х = ТочкаНачальныйИндекс.Х + СмещениеХ;
	НоваяТочка.У = ТочкаНачальныйИндекс.У + СмещениеУ;
	Если УвеличитьПитона Тогда
		НоваяТочка = Питон.Вставить(ПоследнийИндекс + 1);
    	НоваяТочка.Х = ТочкаНачальныйИндекс.Х + СмещениеХ;
		НоваяТочка.У = ТочкаНачальныйИндекс.У + СмещениеУ;
		УвеличитьПитона = Ложь;
		УвеличитьСкорость();
	КонецЕсли;
	
	
КонецПроцедуры	
//шаг 14---

// Шаг№4+++
&НаКлиенте
Процедура  ОтображениеПитонаНаИгравомПоле(СмещениеХ=0,СмещениеУ=0,ДобавитьТочку=Ложь)
	  //Шаг 13+++
	  Если СмещениеХ <> 0 ИЛИ СмещениеУ <> 0 Тогда
		  Для Каждого Точка из Питон Цикл
			  Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
			  Область.ЦветФона = Новый Цвет(244,236,197);
		  КонецЦикла;	  
		  ДлинаПитона = Питон.Количество();
		  //Алгоритм обработки движения
		  // Движение вверх если сдвихХ <0
		  Если СмещениеХ <0 Тогда
			 ДвижениеПоОсям(ДлинаПитона,СмещениеХ,СмещениеУ);
		  ИначеЕсли СмещениеУ > 0 Тогда
			 ДвижениеПоОсям(ДлинаПитона,СмещениеХ,СмещениеУ);
		  ИначеЕсли СмещениеУ < 0 Тогда
			 ДвижениеПоОсям(ДлинаПитона,СмещениеХ,СмещениеУ);
		 ИначеЕсли СмещениеХ > 0 Тогда
			 ДвижениеПоОсям(ДлинаПитона,СмещениеХ,СмещениеУ);
		  КонецЕсли;	  
	  КонецЕсли;	  
	  //Шаг 13---
	  
	  // Шаг№5+++
	  Для Каждого Точка из Питон Цикл
		 Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
		 Область.ЦветФона = Новый Цвет(0,255,0); // зеленый
	  КонецЦикла;	  
	  // Шаг№4---
КонецПроцедуры	
// Шаг№3---


 // Шаг№6+++
 #Область УправлениеДвижением
&НаКлиенте
Процедура ДвижениеВверх(Команда)
	ДвижениеХ = -1;    // Шаг 7 добавляем реквизит на форму с типом число
	ДвижениеУ = 0;     // Шаг 7 добавляем реквизит на форму с типом число
КонецПроцедуры
&НаКлиенте
Процедура ДвижениеВПраво(Команда)
	ДвижениеХ = 0;   
	ДвижениеУ = 1;    
КонецПроцедуры
&НаКлиенте
Процедура ДвижениеВниз(Команда)
	ДвижениеХ = 1;   
	ДвижениеУ = 0;
КонецПроцедуры
&НаКлиенте
Процедура ДвидениеВлево(Команда)
	ДвижениеХ = 0;   
	ДвижениеУ = -1;
КонецПроцедуры

 #КонецОбласти
 // Шаг№5---
 
 //Шаг 21+++
 &НаКлиенте
Процедура ПаузаИгры(Команда)
	Если Не ПаузаИгры И Не КонецИгры Тогда
		ОтключитьОбработчикОжидания("Игра");
		ПаузаИгры=Истина;
	ИначеЕсли Не КонецИгры Тогда 
		ПодключитьОбработчикОжидания("Игра",1-СкоростьИгры*0.1,Истина);
		ПаузаИгры=ложь;
	КонецЕсли;	
КонецПроцедуры
//Шаг 21---
 
//Шаг 18+++
&НаКлиенте
Процедура ЧтоПередПитоном()
	ТочкаПитона = Питон[0];
	Если ТочкаПитона.Х = ЕдаХ И ТочкаПитона.У = ЕдаУ Тогда
		УдалитьЯблоко();
		УвеличитьПитона = Истина; // Шаг 19
		ДобавитьЯблоко();
	ИначеЕсли ТочкаПитона.Х > 25 ИЛИ ТочкаПитона.Х < 1 Или ТочкаПитона.У > 25 ИЛИ ТочкаПитона.У < 1 Тогда
		КонецИгры = Истина;	
	КонецЕсли;	
КонецПроцедуры	
//Шаг 18---

//Шаг 9  +++
&НаКлиенте
Процедура Игра()
	ОтображениеПитонаНаИгравомПоле(ДвижениеХ,ДвижениеУ,ДобавитьЕду);  //шаг 10 ДобавитьТочку - добавить реквезит на форму тип булево
	ДобавитьЕду = Ложь;
	
	ЧтоПередПитоном();
	Если Не КонецИгры Тогда   //шаг 12  добавить реквезит на форму тип булево
		ПодключитьОбработчикОжидания("Игра",1-СкоростьИгры*0.1,Истина); // шаг 11
	Иначе
		УдалитьЯблоко();
		УдалитьПитона();
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ИграЗавершение", ЭтотОбъект), "GAME OVER");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИграЗавершение(ДополнительныеПараметры) Экспорт
	
	// не пригодилось
	
КонецПроцедуры

	
//Шаг 9 ---

 