Функция ВыборФайловИКаталогов(Реж,Фильтр,Заголовок,Каталог=Неопределено) Экспорт
	РеквизитВвода = "";
	Если Реж="Файл" Тогда
		
		Режим = РежимДиалогаВыбораФайла.Открытие;
	Иначе
		
		Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
		
	КонецЕсли; 
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//Фильтр = НСтр("ru = 'Все файлы(*.*)'");
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	Если Реж="Файл" Тогда
		Если Каталог<>Неопределено Тогда
			
			ДиалогОткрытияФайла.Каталог=Каталог;
			
			
		КонецЕсли; 
	КонецЕсли; 
	//ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите каталог'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
			Если Реж="Файл" Тогда
				РеквизитВвода = ДиалогОткрытияФайла.ПолноеИмяФайла;
				
			Иначе
				РеквизитВвода = ДиалогОткрытияФайла.Каталог;
				
			КонецЕсли; 
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Возврат РеквизитВвода;
	
	
КонецФункции //ВыборФайловИКаталогов()
 функция ПреобразоватьВURL(ТекИмяФайла) Экспорт
	 ИмяФайла =  СтрЗаменить(ТекИмяФайла," ","%20" );
	 ИмяФайла =  СтрЗаменить(ИмяФайла,"\","/");
	 Возврат "file:/" + "/localhost/" + ИмяФайла;
 Конецфункции
Функция СоздатьПапкуДляВложенныхФайлов(ПапкаРодитель,ИмяПапки)  Экспорт
	ЕстьКаталог = Ложь;
	Если ЗначениеЗаполнено(ПапкаРодитель) Тогда
		ИмяКаталога= СокрЛП(ПапкаРодитель)+"\"+СокрЛП(ИмяПапки);
		КаталогНаДиске = Новый Файл(ИмяКаталога);
		Если КаталогНаДиске.Существует() Тогда
			ЕстьКаталог = Истина;
		Иначе  	
			Попытка
				СоздатьКаталог(ИмяКаталога);
				ЕстьКаталог = Истина;
			Исключение
				ОбщееНазначение.СообщитьПользователю("Каталог ." +ИмяКаталога + " не создан." );
			КонецПопытки;
		КонецЕсли; 
	Иначе
		ОбщееНазначение.СообщитьПользователю("Не указана папка для сохранения.");
		
	КонецЕсли; 
	Возврат ЕстьКаталог;	
КонецФункции // СоздатьПапкуДляВложенныхФайлов(ПапкаРодитель,ТекНомер)
