&НаСервереБезКонтекста
Функция  НайтиПоАртикулу(Артикул)
	СсылкаНаТовар = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	Возврат СсылкаНаТовар;
КонецФункции //  НайтиПоАртикулу()()

&НаКлиенте
Процедура ОткрытьТовар(Команда)
	Если ЗначениеЗаполнено(Товар) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",Товар);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоРеквизитуИОткрытьТовар(Команда)
	Если ЗначениеЗаполнено(Артикул) Тогда
		Товар = НайтиПоАртикулу(Артикул);
		Если ЗначениеЗаполнено(Товар) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ",Товар);
			ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСПараметрами(Команда)
	Если ЗначениеЗаполнено(Товар) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",Товар);
		ПараметрыФормы.Вставить("ОтображатьЦену",ОтображатьЦену);
		ПараметрыФормы.Вставить("ДоступностьПартии",ДоступностьПартии);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокТоваров(Команда)
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонстант(Команда)
	ОткрытьФорму("ОбщаяФорма.ВсеКонстанты");
КонецПроцедуры
