
&НаСервере
Функция  НачисленияВидНачисленияПриИзмененииНаСервере(Сотрудник,ВидНачисления)
	Если ВидНачисления = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОкладыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ОкладыСотрудниковСрезПоследних.Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.ОкладыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ОкладыСотрудниковСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", Объект.Дата);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Оклад;
		КонецЕсли;
	КонецЕсли;
	Возврат 0;

КонецФункции

&НаКлиенте
Процедура НачисленияВидНачисленияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	ТекущиеДанные.Размер = НачисленияВидНачисленияПриИзмененииНаСервере(ТекущиеДанные.Сотрудник,ТекущиеДанные.ВидНачисления);
КонецПроцедуры
