
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.СформироватьПриОткрытии=Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	Настройки.Элементы[0].Значение = '20190101';
	Настройки.Элементы[1].Значение = '20231231';
	ПорядокНомер = Настройки.Элементы[3].Элементы[1];
	ПорядокНомер.Использование = Ложь;
	
	Если Настройки.Элементы[3].Элементы.Количество()<=2  Тогда
		ЭлементПорядка = Настройки.Элементы[3].Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Количество");  
		ЭлементПорядка.Использование = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Настройки.параметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",'20190101');
	Настройки.параметрыДанных.УстановитьЗначениеПараметра("КонецПериода",'20231231');
КонецПроцедуры
