
&НаКлиенте
Процедура ЗаписатьОбед(Команда)
	ЗаписатьОбедНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбедНаСервере()
	Если НЕ ЗначениеЗаполнено(ДатаОбеда) Тогда
		ДатаОбеда = ТекущаяДата();
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ВариантОбеда) Тогда
		ВариантОбеда = Справочники.ВариантыОбедов.Куритца;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Сообщить("Укажите пользователя");
		Возврат;
	КонецЕсли;	
	НайденныйОбед = Справочники.ОбедыПользователей.НайтиПоРеквизиту("ДатаОбеда",ДатаОбеда,,Пользователь);
	Если ЗначениеЗаполнено(НайденныйОбед) Тогда 
		  ОбъектОбед = НайденныйОбед.ПолучитьОбъект();
	Иначе 
		  ОбъектОбед = Справочники.ОбедыПользователей.СоздатьЭлемент();
		  ОбъектОбед.Владелец = Пользователь;
		  ОбъектОбед.ДатаОбеда = ДатаОбеда; 
	КонецЕсли; 	
	      ОбъектОбед.Наименование = ""+ Пользователь+ " Дата "+ ДатаОбеда;
		  ОбъектОбед.Записать();
КонецПроцедуры

