//ВЫБРАТЬ
//	Цифры.Поле1 КАК Цифра
//ПОМЕСТИТЬ Цифры
//ИЗ
//	(ВЫБРАТЬ
//		1 КАК Поле1
//	
//	ОБЪЕДИНИТЬ
//	
//	ВЫБРАТЬ
//		2
//	
//	ОБЪЕДИНИТЬ
//	
//	ВЫБРАТЬ
//		3
//	
//	ОБЪЕДИНИТЬ
//	
//	ВЫБРАТЬ
//		4
//	
//	ОБЪЕДИНИТЬ
//	
//	ВЫБРАТЬ
//		5
//	
//	ОБЪЕДИНИТЬ
//	
//	ВЫБРАТЬ
//		6
//	
//	ОБЪЕДИНИТЬ
//	
//	ВЫБРАТЬ
//		7
//	
//	ОБЪЕДИНИТЬ
//	
//	ВЫБРАТЬ
//		8) КАК Цифры
//;

//////////////////////////////////////////////////////////////////////////////////
//ВЫБРАТЬ
//	(Цифры3.Цифра - 1) * 512 + (Цифры2.Цифра - 1) * 64 + (Цифры.Цифра - 1) * 8 + Цифры1.Цифра КАК Число
//ПОМЕСТИТЬ Числа
//ИЗ
//	Цифры КАК Цифры,
//	Цифры КАК Цифры1,
//	Цифры КАК Цифры2,
//	Цифры КАК Цифры3
//;

//////////////////////////////////////////////////////////////////////////////////
//ВЫБРАТЬ
//	ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, Числа.Число - 1) КАК Дата
//ПОМЕСТИТЬ Даты
//ИЗ
//	Числа КАК Числа
//ГДЕ
//	ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, Числа.Число - 1) <= &ДатаОкончания
//;

//////////////////////////////////////////////////////////////////////////////////
//ВЫБРАТЬ
//	Даты.Дата КАК Дата,
//	ВЫБОР ДЕНЬНЕДЕЛИ(Даты.Дата)
//		КОГДА 6
//			ТОГДА 0
//		КОГДА 7
//			ТОГДА 0
//		ИНАЧЕ 1
//	КОНЕЦ КАК РабочийДень
//ИЗ
//	Даты КАК Даты

//УПОРЯДОЧИТЬ ПО
//	Дата