
&НаСервереБезКонтекста
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура)
	 Возврат Номенклатура.ЦенаПоступления;
КонецФункции
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.ЦенаРеализации = ТоварыНоменклатураПриИзмененииНаСервере(Товар.Номенклатура)* 1.25;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
    Товар.Стоимость = Товар.ЦенаРеализации * Товар.Количество;
КонецПроцедуры
