
&НаСервереБезКонтекста
Процедура ОбработатьДокументыНаСервере(ТипДокумента,ТипДействия,Организация,ПериодОтбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка,
	|	ПоступлениеТоваров.Проведен,
	|	ПоступлениеТоваров.ПометкаУдаления,
	|	ПоступлениеТоваров.Представление
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ  Истина";
	
	Если ЗначениеЗаполнено(ПериодОтбора) Тогда
		ДатаНачала = ПериодОтбора.ДатаНачала;
		ДатаОкончания = ПериодОтбора.ДатаОкончания;
		
		Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
		
		Запрос.Текст = Запрос.Текст + " И ПоступлениеТоваровИУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	КонецЕсли; 
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.Текст = Запрос.Текст + " И ПоступлениеТоваровИУслуг.Организация = &Организация";
		
		
	КонецЕсли; 
	Если ТипДокумента=1 Тогда
	ИначеЕсли ТипДокумента=2 Тогда
		
		Запрос.Текст =СтрЗаменить(Запрос.Текст,"ПоступлениеТоваровИУслуг","РеализационнаяНакладная");
	ИначеЕсли ТипДокумента=3 Тогда
		
		Запрос.Текст =СтрЗаменить(Запрос.Текст,"ПоступлениеТоваровИУслуг","Возврат");
	ИначеЕсли ТипДокумента=4 Тогда
		
		Запрос.Текст =СтрЗаменить(Запрос.Текст,"ПоступлениеТоваровИУслуг","Счет");
		
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипДействия = 1 Тогда
			Текобъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Текобъект.Записать(РежимЗаписиДокумента.Запись);
			Сообщить(ВыборкаДетальныеЗаписи.Представление);
		ИначеЕсли ТипДействия = 2 Тогда
			Если ВыборкаДетальныеЗаписи.Проведен Тогда
				Текобъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Текобъект.Записать(РежимЗаписиДокумента.Проведение);
				
				Сообщить(ВыборкаДетальныеЗаписи.Представление);
				
				
			КонецЕсли; 
		ИначеЕсли ТипДействия = 3 Тогда
			Если Не ВыборкаДетальныеЗаписи.Проведен Тогда
				Текобъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				Текобъект.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить(ВыборкаДетальныеЗаписи.Представление);
				
				
			КонецЕсли; 
			
		ИначеЕсли ТипДействия = 4 Тогда
			Если ВыборкаДетальныеЗаписи.Проведен Тогда
				Текобъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				Текобъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Сообщить(ВыборкаДетальныеЗаписи.Представление);
				
				
			КонецЕсли; 
			
		ИначеЕсли ТипДействия = 5 Тогда
			Если Не ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
				Текобъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				Текобъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Текобъект.ПометкаУдаления = Истина;
				Текобъект.Записать(РежимЗаписиДокумента.Запись);
				Сообщить(ВыборкаДетальныеЗаписи.Представление);
				
			КонецЕсли; 
			
		ИначеЕсли ТипДействия = 6 Тогда
			Если  ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
				Текобъект = ВыборкаДетальныеЗаписи.ПолучитьОбъект();
				Текобъект.ПометкаУдаления = Ложь;
				
				Текобъект.Записать(РежимЗаписиДокумента.Запись);
				Сообщить(ВыборкаДетальныеЗаписи.Представление);
				
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДокументы(Команда)
	ОбработатьДокументыНаСервере(ТипДокумента,ТипДействия,Организация,ПериодОтбора);
КонецПроцедуры
