
&НаСервереБезКонтекста
Процедура РаботаСДокументамиНаСервере()
	ПНОбъект = Документы.ПоступлениеТоваровИУслуг.СоздатьДокумент();
	ПНОбъект.Дата=ТекущаяДата();
	ПНОбъект.Контрагент=Справочники.Контрагенты.ЧастноеЛицо;
	ПНОбъект.Организация=ПараметрыСеанса.ОсновнаяОрганизация;
	ПНОбъект.ТорговаяТочка=ПараметрыСеанса.ОсновнаяТогроваяТочка;
	ПНОбъект.Записать(РежимЗаписиДокумента.Запись);
	ПНОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	
	ПН = Документы.ПоступлениеТоваровИУслуг;
	ПННСсылка = ПН.НайтиПоНомеру("000000003") ;
	ПННОбъект = ПННСсылка.ПолучитьОбъект();
	ПННОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровИУслуг
		|ГДЕ
		|	ПоступлениеТоваровИУслуг.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", "000000003");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	    ТекОбъект.дата= ТекущаяДата();
		ТекОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЦикла;
	

	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСДокументами(Команда)
	РаботаСДокументамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаМоментВремениНаСервере()
	Сообщить(ПоступлениеТоваровИУслуг.МоментВремени());
КонецПроцедуры

&НаКлиенте
Процедура КомандаМоментВремени(Команда)
	// ОткрытьФорму("Документ.ПоступлениеТоваровИУслуг.ФормаОбъекта"); 
	КомандаМоментВремениНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСуммуПрописью(Команда)
	Сообщить(ОбщееНазначение.СуммаПрописью(Сумма));
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Сообщить(ОбщееНазначение.СуммаПрописью(Сумма));
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыбратьДокументыЗаПериодНаСервере(ПериодВыборки)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровИУслуг.Ссылка,
		|	ПоступлениеТоваровИУслуг.Номер,
		|	ПоступлениеТоваровИУслуг.Дата,
		|	ПоступлениеТоваровИУслуг.Контрагент
		|ИЗ
		|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
		|ГДЕ
		|	ПоступлениеТоваровИУслуг.Дата МЕЖДУ &ДатаН И &ДатаО";
	
	Запрос.УстановитьПараметр("ДатаН", ПериодВыборки.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаО", ПериодВыборки.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументыЗаПериод(Команда)
	ВыбратьДокументыЗаПериодНаСервере(ПериодВыборки);
КонецПроцедуры
