
&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстанты()
	Возврат Константы.РасчитатьСтоимостьАвтоматически.Получить();
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСтоимостьАвтоматически = ПолучитьЗначениеКонстанты();	
	Если РасчитатьСтоимостьАвтоматически = Истина  Тогда
		 Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.ЦенаПоступления * 
		 										   Элементы.Товары.ТекущиеДанные.Количество;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаша(Команда)
	Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ТоварыПередУдалениемНаСервере(ТекДокумент,Товар)
	ЗаписьЖурналаРегистрации("ПоступлениеТоваров.УдалениеСтроки",УровеньЖурналаРегистрации.Информация,,ТекДокумент,"Удаление номенклатуры из документа "+Товар);
КонецПроцедуры
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	ТД = Элементы.Товары.ТекущиеДанные;
	Товар = ТД.Номенклатура;
	ТоварыПередУдалениемНаСервере(Объект.Ссылка,Товар);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ЗаписатьИнформациюВЖурнал(ТекДокумент,Товар,СтараяЦена,НоваяЦена)
	 ЗаписьЖурналаРегистрации("ПоступлениеТоваров.ИзменениеЦеныПоступления",   УровеньЖурналаРегистрации.Информация,,ТекДокумент ,
	"Изменение цены по товару "+Товар+" старая цена " +СтараяЦена+ " новая цена " + НоваяЦена);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	Товар = ТД.Номенклатура;
	НоваяЦена = ТД.ЦенаПоступления;
	ЗаписатьИнформациюВЖурнал(Объект.Ссылка,Товар,СтараяЦена,НоваяЦена);
	СтараяЦена = НоваяЦена;
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Стоимость = ОбщееНазначение.РасчитатьСуммуТабличнойЧасти(ТекущиеДанные.Количество,ТекущиеДанные.ЦенаПоступления);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтараяЦена = Элементы.Товары.ТекущиеДанные.ЦенаПоступления;  
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НесколькоСкладов = Константы.НесколькоСкладов.Получить();
	Если НесколькоСкладов Тогда
		Объект.Склад = Константы.СкладПоУмолчанию.Получить(); 
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПояснениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;  
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ЗначениеПояснения = ТекущаяСтрока.Пояснение;

	ПараметрыВвода = Новый Структура("ПриемникПояснения",ЗначениеПояснения);
	
	ОткрытьФорму("Документ.ПоступлениеТоваров.Форма.ФормаВводаПояснения",ПараметрыВвода,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры
 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Дата = НачалоМесяца(Объект.Дата);
КонецПроцедуры


