
&НаСервере
Процедура НажмиНаКнопкуНаСервере()
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(Справочники.Склады.Оптовый);
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("Розница"));
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Склад В(&МассивСкладов)";
	
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Ссылка);
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура НажмиНаКнопку(Команда)
	НажмиНаКнопкуНаСервере();
КонецПроцедуры
