
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ВалютаБаланса =Константы.ВалютаБаланса.Получить();
		
		
		
		//Если Не ЗначениеЗаполнено(КурсВалютыБаланса) Тогда
		
		
		
		Если ВалютаБаланса = Справочники.Валюты.НациональнаяВалюта Тогда
			
			КурсВалютыБаланса=1;
		Иначе
			КурсВалютыБаланса=ОбщегоНазначения.ПолучитьКурс(ВалютаБаланса, Дата);
			
			
		КонецЕсли; 
		//КонецЕсли; 
		
	
	Если ПометкаУдаления<>Ссылка.ПометкаУдаления Тогда
	
		Набор = Движения.РегистрУправленческий;
		Набор.Прочитать();
		Набор.УстановитьАктивность(Не ПометкаУдаления);
		Набор.Записывать = Истина;
	
	КонецЕсли; 
	 Для каждого Проводка Из Движения.РегистрУправленческий Цикл
	      Проводка.Период=Дата;
	      Проводка.Организация=Организация;
	      
	 	
	 
	 КонецЦикла; 
	
КонецПроцедуры
