&НаСервере
Процедура ЗагрузитьДанныеНаСервере(ВидСправочника,ПутьКФайлу)      Экспорт
	Док = Новый ТекстовыйДокумент();
	Док.Прочитать(ПутьКФайлу,КодировкаТекста.UTF8);
	Для А=1 По Док.КоличествоСтрок() Цикл	
		Строка = Док.ПолучитьСтроку(А);
		Массив = СтрРазделить(Строка, ";");
		Наименование = Массив[0];
		Справочник = Справочник[ВидСправочника];
		Если ВидСправочника = "Номенклатура" Тогда
			ВидНоменклатуры = Массив[1];
		ИначеЕсли ВидСправочника = "Контрагенты" Тогда
			РеквезитСправочника = Массив[1];
		КонецЕсли;	
		НовыйСправочник = Справочник.СоздатьЭлемент();
		НовыйСправочник.Наименование = Наименование;
		Если Массив.Количество()> 2 Тогда 
			Группа = Массив[2];
			ПоискГруппа =  Справочник.НайтиПоНаименованию(Группа);
			Если ПоискГруппа.Пустая() Тогда 
				ГруппаНовый = Справочник.СоздатьГруппу();
				ГруппаНовый.Наименование = Группа;
				ГруппаНовый.Записать();
				НовыйСправочник.Родитель =   ГруппаНовый.Ссылка;
			Иначе
				НовыйСправочник.Родитель =   ПоискГруппа;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВидСправочника = "Контрагенты" Тогда
			НовыйСправочник.ИНН = РеквезитСправочника;
		КонецЕсли;	
		Если ВидНоменклатуры = "Товар" Тогда
			НовыйСправочник.ВидНоменклатуры = Справочники.ВибыНоменклатура.Товар;
		ИначеЕсли ВидНоменклатуры = "Услуга" Тогда
			НовыйСправочник.ВидНоменклатуры = Справочники.ВибыНоменклатура.Услуга;				
		КонецЕсли;
		
		НовыйСправочник.Записать(); 
	КонецЦикла;
КонецПроцедуры
