
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ПолноеЮридическоеНаименование) Тогда
		Объект.ПолноеЮридическоеНаименование = Объект.Наименование;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыМобильныйПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Контакты.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Мобильный) Тогда
		ТекущиеДанные.ПризнакМобильный = Истина;
	Иначе
		ТекущиеДанные.ПризнакМобильный = Ложь;
	КонецЕсли;	                               
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сообщить(ЭтотОбъект.ИмяФормы);
КонецПроцедуры

