
&НаСервере
Процедура ПроверкаПравДоступаНаСервере()
	Если РольДоступна("Продавец") Тогда
		
		Сообщить("Роль " +"""Продавец"""+" доступна" );
		
	Иначе
		Сообщить("Роль " +"""Продавец"""+" не доступна" );
	КонецЕсли;
	
	
	Сообщить(" Автомобили " +ПравоДоступа("Чтение",Метаданные.Справочники.Автомобили));	
	Сообщить(" Товары добавление " +    ПравоДоступа("Добавление",Метаданные.Справочники.Товары));	
	Сообщить(" Товары Цена редактирование " +    ПравоДоступа("Редактирование",Метаданные.Справочники.Товары.Реквизиты.Цена));	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПравДоступа(Команда)
	ПроверкаПравДоступаНаСервере();
КонецПроцедуры
