
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	    // 1. Установка маркера Записи у регистра
    Движения.ДополнительныеНачисленияПроцентОтПродажиТовара.Записывать = Истина;
    
    // 2. Движения по регистру
    Для каждого СтрокаТЧ Из ДополнительныеНачисления Цикл
        Запись = Движения.ДополнительныеНачисленияПроцентОтПродажиТовара.Добавить();
        Запись.Параметр = СтрокаТЧ.Размер;
        ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ);
        Запись.БазовыйПериодНачало = НачалоМесяца(ПериодРегистрации - 1);
        Запись.БазовыйПериодКонец = КонецМесяца(Запись.БазовыйПериодНачало);
        Запись.ПериодРегистрации = ПериодРегистрации;
    КонецЦикла;
    
    // 3. Запись движений документа до выполнения расчетов
    Движения.Записать();
    
    // 4. Выполнение расчетов для записанных наборов записей 
	РасчетЗП.РассчитатьЗаписиДополнительногоРегистра(Движения.ДополнительныеНачисленияПроцентОтПродажиТовара,Ссылка);
КонецПроцедуры
