
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ОсновнаяОрганизация = Константы.НазваниеОрганизации.Получить();
	Если  ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		 Префикс = ОсновнаяОрганизация.Префикс;
	КонецЕсли; 	
	//Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
	//	Если ЭтотОбъект.ВидНоменклатуры =Справочники.ВибыНоменклатура.НайтиПоНаименованию("Товар") Тогда 
	//		Префикс = "Т- ";
	//	ИначеЕсли ЭтотОбъект.ВидНоменклатуры =Справочники.ВибыНоменклатура.НайтиПоНаименованию("Услуга") Тогда
	//		Префикс = "У- ";
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//ПроверкаНаДублиВНаименовании =ОбщееНазначение.ПроверкаНаименованияСправочникаНаПовторение(Наименование,"Номенклатура",Ссылка);
	//Если ПроверкаНаДублиВНаименовании Тогда
	//	Отказ = Истина;
	//КонецЕсли;	

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Если Не ЭтоГруппа Тогда
		Артикул ="";
	КонецЕсли;	
КонецПроцедуры



