
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Адрес = "https://its.1c.ru/db/v8std";
	Страница =  Объект.Адрес;
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиПоАдресу(Команда)
	Страница =  Объект.Адрес;
КонецПроцедуры


&НаКлиенте
Процедура Назад(Команда)
	Элементы.Страница.Назад();
КонецПроцедуры


&НаКлиенте
Процедура Вперед(Команда)
	Элементы.Страница.Вперед();
КонецПроцедуры

&НаКлиенте
Процедура АдресОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Страница = Текст; Объект.Адрес = Текст; 
КонецПроцедуры



&НаКлиенте
Процедура СтраницаДокументСформирован(Элемент)
	Объект.Адрес = Элемент.Документ.url;
КонецПроцедуры
