&НаКлиенте
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	 МассивСтрок = Новый Массив;
	 
	 Если Разделитель = " " Тогда 
		  Стр = СокрЛП(Стр);
		  Пока Истина   Цикл
			  Позиция = Найти(Стр, Разделитель);
			  Если Позиция = 0 Тогда 
				  МассивСтрок.Добавить(Стр);
				  Возврат МассивСтрок;
			  КонецЕсли; 	  
		  	  МассивСтрок.Добавить(Лев(Стр,Позиция-1)); 
			  Стр = СокрЛ(Сред(Стр,Позиция));
		  КонецЦикла;	  
	 Иначе	 
		  ДлинаРазделителя = СтрДлина(Разделитель);
		  Пока Истина Цикл  
			  Позиция =  Найти(Стр, Разделитель);
			  Если Позиция = 0 Тогда 
				  МассивСтрок.Добавить(Стр);
				  Возврат МассивСтрок;
			  КонецЕсли; 	  
              МассивСтрок.Добавить(Лев(Стр,Позиция-1)); 
			  Стр = СокрЛ(Сред(Стр,Позиция));
		  КонецЦикла;	  
	 КонецЕсли;	 
КонецФункции	
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='CSV файл (*.csv)|*.csv'");
	ДиалогВыбораФайла.Заголовок                   = НСтр("ru='Выберите CSV файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "csv";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла              = ПутьКФайлу;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	Разделитель = ";";
	//очищаем таблицу и удаляем информацию
	Если Таблица.Количество()  > 0 Тогда
		Таблица.Очистить();
		Таблица.Колонки.Очистить();
		Элементы.Таблица.Колонки.Очистить();
	КонецЕсли;
	//Чтение файла
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(ПутьКФайлу);
	
	//шапка по умолчанию 1 строка, из первой строки делаем колонки таблицы
	Шапка = ЗагружаемыйФайл.ПолучитьСтроку(1);
	
	//раскладываем строку в массив
	МассивКолонок =   РазложитьСтрокуВМассивПодстрок(Шапка,Разделитель);
	
	//генерируем колонки
	Для Каждого ИмяКолонки Из Массивколонок Цикл 
		ИмяБезПробелов = СтрЗаменить(ИмяКолонки," ","");
		НоваяКолонка = Элементы.Таблица.Колонки.Добавить(ИмяБезПробелов,ИмяКолонки);
		НоваяКолонка.Данные = ИмяБезПробелов;
	КонецЦикла;
	
	//Обработка загрузки данных
	Для НомерСтроки=2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
		Состояние("Обрабатывается "+Строка(Формат(?(ЗагружаемыйФайл.КоличествоСтрок()=0,0,((100*НомерСтроки)/ЗагружаемыйФайл.КоличествоСтрок())),"ЧЦ=3 ЧДЦ=0"))+" %");
		ОбработкаПрерыванияПользователя(); 
		//получить строку файла с указанным номером и преобразуем в массив
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКолонок = РазложитьСтрокуВМассивПодстрок(Строка,Разделитель);
		НоваяСтрока = Таблица.Добавить();
		
		Если МассивКолонок.Колисество() <> Таблица.Колонки.Количество() Тогда
			Сообщить("Ошибка со строкой "+ Строка);
			Продолжить;
		КонецЕсли;
		
		Для НомерКолонки = 1 по МассивКолонок.Количество() Цикл
			// заполняем строку значениями
			ТекущееЗначение = МассивКолонок[НомерКолонки-1];
			ИмяКолонки = Таблица.Колонки[НомерКолонки - 1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;	
			
	КонецЦикла;	
КонецПроцедуры
