Процедура ЗаполнитьВалюту()  Экспорт
	Валюта = СчетОрганизации.ВалютаСчета;
КонецПроцедуры	
Процедура ЗаполнитьВалютнуюСумму(СуммаОсновнойВалюты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	курсыВалютСрезПоследних.Курс КАК Курс,
		|	курсыВалютСрезПоследних.Курс * &СуммаОсновнойВалюты КАК ВалютнаяСумма
		|ИЗ
		|	РегистрСведений.курсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК курсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("СуммаОсновнойВалюты", СуммаОсновнойВалюты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ВалютнаяСумма = Выборка.ВалютнаяСумма;
	КонецЕсли;
	
	
КонецПроцедуры	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		Сумма = ДанныеЗаполнения.ОбщаяСтоимость;
		Контрагент = ДанныеЗаполнения.Поставщик;
		Заказ = ДанныеЗаполнения.Ссылка;
		СчетКонтрагента = ДанныеЗаполнения.СчетКонтрагента;
		СчетОрганизации = ДанныеЗаполнения.СчетОрганизации;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Если Не ЗначениеЗаполнено(ВалютнаяСумма) Тогда 
		Отказ =Истина;
	КонецЕсли;	
	// регистр Хозяйственный 
	Движения.Хозяйственный.Записывать = Истина;
	Движение = Движения.Хозяйственный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
	Движение.ВалютнаяСумма = ВалютнаяСумма;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Контрагент.ОсновнойДоговор;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
