Функция ПолучитьУзелОрганизации(ТекОрганизация) Экспорт
	СписокУзлов = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УниверсальныйОбмен.Ссылка
	|ИЗ
	|	ПланОбмена.УниверсальныйОбмен КАК УниверсальныйОбмен
	|ГДЕ
	|	УниверсальныйОбмен.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУзлов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	
	Возврат СписокУзлов	;
	
КонецФункции // ПолучитьУзелОрганизации()
