
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
		СтандартнаяОбработка = Ложь;
		
		//1. получение схемы компоновки данных
	    СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		
		//2. получение настроек компановки данных
		НастройкиКомпановки = КомпоновщикНастроек.ПолучитьНастройки();
		
		КоллекцияПараметров = НастройкиКомпановки.ПараметрыДанных;
		Параметр_Период = КоллекцияПараметров.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Если Параметр_Период<> Неопределено Тогда 
			 ЗначениеПараметраПериод = Параметр_Период.Значение;
			 ДатаНачало = ЗначениеПараметраПериод.ДатаНачало;
			 ДатаОкончания = ЗначениеПараметраПериод.ДатаОкончания;

		Иначе
			ДатаНачало = '00010101';
			ДатаОкончания = '00010101';
		КонецЕсли;	
		ТаблицаЖурнала = Новый ТаблицаЗначений;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ДатаНачала", ДатаНачало);
		СтруктураОтбора.Вставить("ДатаОкончания", ДатаОкончания);
		СтруктураОтбора.Вставить("Добавление","_$Data$_.New"); 
		СтруктураОтбора.Вставить("Удаление","_$Data$_.Delete");
		СтруктураОтбора.Вставить("УдалениеПредопределенныхДанных","_$Data$_.DeletePredefinedData");
		СтруктураОтбора.Вставить("ДобавлениеПредопределенныхДанных","_$Data$_.NewPredefinedData");
		СтруктураОтбора.Вставить("Проведение","_$Data$_.Post");
		СтруктураОтбора.Вставить("ОтменаПроведения","_$Data$_.Unpost");
		СтруктураОтбора.Вставить("Метаданные",Метаданные.Документы.ПоступлениеТоваров);	
		Колонки = "Дата,ИмяПользователя,Данные";
		ВыгрузитьЖурналРегистрации(ТаблицаЖурнала,СтруктураОтбора,Колонки);

		//3. получение макета компановки данных
		КомпановщикМакета  = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпановки = КомпановщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиКомпановки);
		
		//4. получение результата отчета (выполнение компановки)
		ВнешниеНаборыДанных = Новый Структура("ЖурналРегистрации",ТаблицаЖурнала);  
		
		ПроцессорКомпановки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпановки.Инициализировать(МакетКомпановки,ВнешниеНаборыДанных);
		
		//5. вывод результата компановки
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпановки);
	
КонецПроцедуры
    