
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ИмяФайла = ПолучитьИмяФайла(".pdf");
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	Сообщить("Файл сохранен" + ИмяФайла);
	ИмяФайла = ПолучитьИмяФайла("."+ТипФайлаТабличногоДокумента.XLSX);
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	Сообщить("Файл сохранен" + ИмяФайла);
	//}}
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Документы.ПоступлениеТоваровИУслуг.Печать(ТабДок, ПараметрКоманды);
КонецПроцедуры
&НаСервере
Функция ПолучитьИмяФайла(РежимЗаписи)
	ДатаДляФайла =СтрЗаменить( СтрЗаменить(Формат(ТекущаяДата(),"ДЛФ=DT"),".","_"),":","_");
	Путь = Константы.ПутьДляСохраненияДокументов.Получить()+"\";
	Возврат Путь+ "Приходные" +ДатаДляФайла+РежимЗаписи;
	
КонецФункции // ()
