
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//1.Создаем реквезит 2.Помещаем реквезит в массив
	Реквезит = Новый РеквизитФормы("ДругоеЗначение",Новый ОписаниеТипов("Строка"));
	МассивРеквезитов = Новый Массив;
	МассивРеквезитов.Добавить(Реквезит);
	//3.Меняем состав  реквезитов формы
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквезитов); // добавление нового реквезита
	//4.Добавляем элемент управления связанный с реквезитом
	НовоеПоле = ЭтаФорма.Элементы.Добавить("ДругоеЗначение", Тип("ПолеФормы"),ЭтаФорма);
	//5.Устанавливаем связь поля с реквезитом
	НовоеПоле.ПутьКДанным = "ДругоеЗначение";
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыводТекущегоВремени();
	ПодключитьОбработчикОжидания("ВыводТекущегоВремени",1);
	Если ЭтаФорма.ЧастотаМирцания < 1 Тогда
		 ЭтаФорма.ЧастотаМирцания =1;
	КонецЕсли;	
	ПодключитьОбработчикОжидания("Мерцание1",ЭтаФорма.ЧастотаМирцания); 
КонецПроцедуры
&НаКлиенте
Процедура ВыводТекущегоВремени()
	Элементы.ТекущаяДата.Заголовок = ТекущаяДата();
	ЭтаФорма.ВыводимыеЗначения = ТекущаяДата();
	ЭтаФорма.ДругоеЗначение = ТекущаяДата();
КонецПроцедуры	

&НаКлиенте
Процедура Мерцание1()
	ОтключитьОбработчикОжидания("Мерцание1");
	Элементы.ЧастотаМирцания.ЦветФона = WebЦвета.ЗеленаяЛужайка;
	ПодключитьОбработчикОжидания("Мерцание2",ЭтаФорма.ЧастотаМирцания); 
КонецПроцедуры	

&НаКлиенте
Процедура Мерцание2()
	ОтключитьОбработчикОжидания("Мерцание2");
	Элементы.ЧастотаМирцания.ЦветФона = WebЦвета.Белый;
	ПодключитьОбработчикОжидания("Мерцание1",ЭтаФорма.ЧастотаМирцания); 
КонецПроцедуры	