
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатур.Ссылка 							КАК Номенклатура,
		|	Номенклатур.Код 							КАК Код,
		|	ОстаткиНаСкладе2Остатки.КоличествоОстаток 	КАК Остаток
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатур
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНаСкладе2.Остатки(, Склады = &Склад) КАК ОстаткиНаСкладе2Остатки
		|		ПО Номенклатур.Код = ОстаткиНаСкладе2Остатки.Номенклатура.Код";
	
	Запрос.УстановитьПараметр("Склад", Параметры.Отбор.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = ТабДок.Добавить();
		Строка.Номенклатура = Выборка.Номенклатура;
		Строка.Код = Выборка.Код;
		Строка.Остаток = Выборка.Остаток;
	КонецЦикла;
	
	
КонецПроцедуры
