 
&НаКлиенте
Процедура С1_Определить(Команда)
	Если С1_Число =0 Тогда
		Предупреждение("Нечет!");
	Иначе
		РезультатДеления = С1_Число/2;
		Если РезультатДеления = Цел(РезультатДеления) Тогда
			Предупреждение("Четное!");
		Иначе
			Предупреждение("Нечет!");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура С2_Наоборот(Команда)
	НоваяСтрока = "";
	СтрДлина = СтрДлина(С2_Строка);
	Для ИндС = 1 по СтрДлина Цикл
		ТекСимвол = Сред(С2_Строка,ИндС,1);
		НоваяСтрока = ТекСимвол+НоваяСтрока;
	КонецЦикла;
	Предупреждение(НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура С3_Пример1(Команда)
	НовоеЗначение = 12 +"2"/2;
	
	Предупреждение(НовоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура С3_Пример2(Команда)
	НовоеЗначение = 12 +"2О"/2;
	
	Предупреждение(НовоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура С3_Пример3(Команда)
	НовоеЗначение = 12 +"2.2"/2;
	
	Предупреждение(НовоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура С3_Пример4(Команда)
	НовоеЗначение = 12 +"2,2"/2;
	
	Предупреждение(НовоеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура С3_Пример5(Команда)
	НовоеЗначение = "10"+12 +"2"/2;
	
	Предупреждение(НовоеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура С3_Пример6(Команда)
	НовоеЗначение = ""+12 +"2"/2;
	
	Предупреждение(НовоеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура С3_Пример7(Команда)
	НовоеЗначение = 1+2*2+" рублей";
	
	Предупреждение(НовоеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура С3_Пример8(Команда)
	
	НовоеЗначение = 1+2*2;
	НовоеЗначение = ""+НовоеЗначение+" рублей";

	Предупреждение(НовоеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура С3_Пример9(Команда)
	НовоеЗначение = Строка(1+2*2)+" рублей";
	
	Предупреждение(НовоеЗначение);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	С4_Строка = "11.12.2021";
	С5_Строка = "Следующий Новый Год наступает 01.01.2022. И это прекрасно";

КонецПроцедуры     

&НаКлиенте
Процедура С4_Преобразовать(Команда)
	НоваяДата = ОбщегоНазначенияКлиентСервер.ДатаИзСтроки(С4_Строка);
	Если НоваяДата = Неопределено Тогда
		Сообщить("Дата введена неправелно");
		С4_Дата = Дата(1,1,1);
	Иначе
		С4_Дата = НоваяДата;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура С5_НайтиДату(Команда)
	МассивСлов = ОбщегоНазначенияКлиентСервер.РазложитСтрокуУдаляяТочкуВконцеСлова(С5_Строка);
	Для Каждого Слово из МассивСлов Цикл
		ДатаИзСтроки = ОбщегоНазначенияКлиентСервер.ДатаИзСтроки(Слово);
		Если НЕ ДатаИзСтроки = Неопределено Тогда 
			С5_Дата = ДатаИзСтроки;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
