
&НаСервере
Процедура ЗаполнитьТаблцуНаСервере()
	// определение вида цены номенклатуры
	// определим остатки на складах
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(ОстаткиНаСкладеОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОстатокНоменклатуры
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладе.Остатки(
		|			&ТекДата,
		|			Склады = &Склад
		|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ОстаткиНаСкладеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНаСкладеОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстатокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ОстатокНоменклатуры.КоличествоОстаток КАК КоличествоОстаток,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	ОстатокНоменклатуры КАК ОстатокНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ОстатокНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВибыНоменклатура.Товар);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ЭтаФорма.Таблица.Очистить();
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = ЭтаФорма.Таблица.Добавить();
		 НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		 НоваяСтрока.Количество = Выборка.КоличествоОстаток;
		 НоваяСтрока.Цена = Выборка.Цена;
		 НоваяСтрока.Стоимость = ОбщееНазначение.РасчитатьСуммуТабличнойЧасти(Выборка.КоличествоОстаток,Выборка.Цена);
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблцу(Команда)
	ЗаполнитьТаблцуНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура РасчитатьСтоимость()
	Элементы.Таблица.ТекущиеДанные.Стоимость = ОбщееНазначение.РасчитатьСуммуТабличнойЧасти(Элементы.Таблица.ТекущиеДанные.Количество,Элементы.Таблица.ТекущиеДанные.Цена);
КонецПроцедуры	
&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)
	РасчитатьСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)
	РасчитатьСтоимость();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументНаСервере()
	// Этап 2. Преобразование основного реквизита формы в прикладной объект
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	// Этап 3. Вызов процедуры модуля объекта
	ОбработкаОбъект.СоздатьДокументРеализацияТоваров(Склад,ВидЦены,СразуПроводитьДокумент,Таблица);
	// Этап 4. Обратное преобразование прикладного объекта в реквизит формы
	//ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	// Этап 1. Вызов серверной процедуры
	СоздатьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблцу1НаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(ОстаткиНаСкладеОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОстатокНоменклатуры
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладе.Остатки(
		|			&ТекДата,
		|			Склады = &Склад
		|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ОстаткиНаСкладеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНаСкладеОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстатокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ОстатокНоменклатуры.КоличествоОстаток КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ОстатокНоменклатуры.КоличествоОстаток * ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость
		|ИЗ
		|	ОстатокНоменклатуры КАК ОстатокНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ОстатокНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВибыНоменклатура.Товар);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица1.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблцу1(Команда)
	ЗаполнитьТаблцу1НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТаблицу2(Команда)
	ЗагрузитьТаблицу2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицу2НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(ОстаткиНаСкладеОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ОстатокНоменклатуры
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладе.Остатки(
		|			&ТекДата,
		|			Склады = &Склад
		|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ОстаткиНаСкладеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНаСкладеОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстатокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ОстатокНоменклатуры.КоличествоОстаток КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ОстатокНоменклатуры.КоличествоОстаток * ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость
		|ИЗ
		|	ОстатокНоменклатуры КАК ОстатокНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ОстатокНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВибыНоменклатура.Товар);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивРеквизитов = Новый Массив;
	Для Каждого ОписаниеКолонки из РезультатЗапроса.Колонки Цикл
		НовыйРеквезит = Новый РеквизитФормы(ОписаниеКолонки.Имя,ОписаниеКолонки.ТипЗначения,"Таблица2");
		МассивРеквизитов.Добавить(НовыйРеквезит);
	КонецЦикла; 
	//
	ИзменитьРеквизиты(МассивРеквизитов);
	Для Каждого ОписаниеКолонки Из РезультатЗапроса.Колонки Цикл
		НоваяКолонка = Элементы.Добавить(ОписаниеКолонки.Имя,Тип("ПолеФормы"),Элементы.Таблица2);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным = "Таблица2." + ОписаниеКолонки.Имя; 
	КонецЦикла;	
	Таблица2.Загрузить(РезультатЗапроса.Выгрузить());
	

КонецПроцедуры
