&НаСервере
Функция ПолучитьЗначениеКонстантыРасчетСтоимости()
	ДаНет = Константы.РасчитатьСтоимостьАвтоматически.Получить();
	Возврат ДаНет;
КонецФункции	
&НаКлиенте
Процедура РасчетСтоимости(Элемент)
	РасчитатьСтоимость = ПолучитьЗначениеКонстантыРасчетСтоимости();
	Если РасчитатьСтоимость Тогда 
		Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтоимостьПриИзменении(Элемент)
	СтоимостьСкидка = ОбщееНазначение.РасчитатьСтоимостьСкидку(Элементы.Товары.ТекущиеДанные.Количество,Элементы.Товары.ТекущиеДанные.ЦенаРеалиации);
	Элементы.Товары.ТекущиеДанные.Стоимость = СтоимостьСкидка[0];
	Элементы.Товары.ТекущиеДанные.Скидка = СтоимостьСкидка[1];
	Элементы.Товары.ТекущиеДанные.СтомостьСоСкидкой =СтоимостьСкидка[2];
КонецПроцедуры
