
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РаботникиОрганизаций.Очистить();
	Движения.РаботникиОрганизаций.Записать();
	
	Ресурсы = ПроверкаДокументов.ПолучитьРесурсыСотрудника(Сотрудник, ПодразделениеОткуда, МоментВремени());
	
	Если Ресурсы.Состояние<>Перечисления.СостоянияРаботников.Работает Тогда
	              
		Сообщить("Сотрудник здесь не работает");
		Отказ = Истина;
		Возврат;
	
	КонецЕсли; 
	
	
		Запись = Движения.РаботникиОрганизаций.Добавить();
		Запись.Период = Дата;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = ПодразделениеОткуда;
		Запись.Состояние = Перечисления.СостоянияРаботников.Уволен;
		Запись.ТипГрафика = ТипГрафика;
	
		Запись = Движения.РаботникиОрганизаций.Добавить();
		Запись.Период = КонецДня(Дата)+1;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = ПодразделениеКуда;
		Запись.Состояние = Перечисления.СостоянияРаботников.Работает;
		Запись.ТипГрафика = ТипГрафика;
		
		Движения.РаботникиОрганизаций.Записывать = Истина;
		
		
		
	
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Дата", Дата);
		ДанныеДокумента.Вставить("Сотрудник", Сотрудник);
		ДанныеДокумента.Вставить("Подразделение", ПодразделениеОткуда);
		ДанныеДокумента.Вставить("МоментВремени", МоментВремени());
		КадровыйУчет.ОбнулитьПлановыеНачисленияУдержания(ДанныеДокумента, Движения);
	// регистр ПлановыеНачисления
	Движения.ПлановыеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ПлановыеНачисления.Добавить();
		Движение.Период = КонецДня(Дата)+1;
		Движение.Сотрудник = Сотрудник;
		Движение.Подразделение = ПодразделениеКуда;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.Значение = ТекСтрокаНачисления.Значение;
	КонецЦикла;

	// регистр ПлановыеУдержания
	Движения.ПлановыеУдержания.Записывать = Истина;
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.ПлановыеУдержания.Добавить();
		Движение.Период = КонецДня(Дата)+1;
		Движение.Сотрудник = Сотрудник;
		Движение.Подразделение = ПодразделениеКуда;
		Движение.ВидРасчета = ТекСтрокаУдержания.ВидРасчета;
		Движение.Значение = ТекСтрокаУдержания.Значение;
	КонецЦикла;
	
КонецПроцедуры
