
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПутьКФайлу = "Путь";
	
	КЧ = Новый КвалификаторыЧисла(12,2);
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
    Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТаблицаДанных = Новый ТаблицаЗначений; 
	ТаблицаДанных.Колонки.Добавить("Наименование",ОписаниеТиповС);	
	ТаблицаДанных.Колонки.Добавить("Сумма",ОписаниеТиповЧ);
	//ТаблицаДанных.Колонки.Добавить("Колонка2");
	
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ПутьКФайлу);
	
	КоличествоСтрок = Текст.КоличествоСтрок();
	Для НомерСтроки = 1 по КоличествоСтрок Цикл 
		ТекСтр = Текст.ПолучитьСтроку(НомерСтроки);
		МассивСлов = СтрРазделить(ТекСтр,",");
		
		Если МассивСлов.Количество()< 2 Тогда
			Продолжить;
		КонецЕсли;
		Наименование = МассивСлов[0];
		Сумма =  МассивСлов[1];
		//НаименованиеКлонки2 =  МассивСлов[2];		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Наименование = Наименование;	
		НоваяСтрока.Сумма = Число(Сумма);
		//НоваяСтрока.Колонка2 = НаименованиеКлонки2;		
	КонецЦикла;	
	
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Наименование КАК Наименование,
		|	ТаблицаДанных.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_ДанныеФайла
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
		|	ВТ_ДанныеФайла.Сумма КАК Сумма
		|ИЗ
		|	ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ВТ_ДанныеФайла.Наименование = Контрагенты.Наименование";
	
	Запрос.УстановитьПараметр("ТаблицаДанных",ТаблицаДанных);
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	
	
	//1. получение схемы компоновки данных
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпанновкиДанных");
	
	//2. получение настроек компановки данных
	НастройкиКомпановки = КомпоновщикНастроек.ПолучитьНастройки();
	
	//3. получение макета компановки данных
	КомпановщикМакета  = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпановки = КомпановщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиКомпановки);
	
	//4. получение результата отчета (выполнение компановки)
	ВнешниеНаборыДанных = Новый Структура("ТаблицаДанных",РезультатЗапроса);  //""ТаблицаДанных"" - на уровне схемы; РезультатЗапроса - на уровне кода 
	
	ПроцессорКомпановки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановки.Инициализировать(МакетКомпановки,ВнешниеНаборыДанных);
	
	//5. вывод результата компановки
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпановки);
	
	
КонецПроцедуры
