
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СобранныеСБ Приход
	Движение = Движения.СобранныеСБ.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Мастер = Мастер;
	Движение.Склад = Склад;
	Движение.СБ = Продукция;
	Движение.Количество = 1;
	Движение.Стоимость = ПереченьНоменклатуры.Итог("Сумма"); 

	// регистр ОстаткиНаСкладе Приход
	Движение = Движения.ОстаткиНаСкладе.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = Продукция;
	Движение.Склады = Склад;
	Движение.Количество = 1;
	//Движение.Поставщик = Мастер;
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура Печать() Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ(Печать)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.СборкаКомпьютера.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(Шапка);
	// ПереченьНоменклатуры
	Область = Макет.ПолучитьОбласть("ПереченьНоменклатурыШапка");
	ТабДок.Вывести(Область);
	ОбластьПереченьНоменклатуры = Макет.ПолучитьОбласть("ПереченьНоменклатуры");
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		ОбластьПереченьНоменклатуры.Параметры.Заполнить(ТекСтрокаПереченьНоменклатуры);
		ТабДок.Вывести(ОбластьПереченьНоменклатуры);
	КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ
КонецПроцедуры

   