
&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере(Документ);
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(Документ)
	
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл("E:\БАЗА 1С\Skillbox1\Файлы внешние\Файлы Для Выгрузки\DataВыгрузить.xml");
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Root");
	
	ЗаписатьXML(Запись, Документ.ПолучитьОбъект());
	
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть();
КонецПроцедуры // ВыгрузитьНаСервере(Документ)()


&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере()
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл("E:\БАЗА 1С\Skillbox1\Файлы внешние\Файлы Для Выгрузки\DataЗагрузить.xml");
	Выполнять = Истина;
	Пока Выполнять Цикл
		Если ВозможностьЧтенияXML(Чтение) Тогда
			// чтение содержимого элемента
			
			Объект = ПрочитатьXML(Чтение);
			Объект.Записать();
		Иначе
			Выполнять = Чтение.Прочитать();
		КонецЕсли;
	КонецЦикла; 
	Чтение.Закрыть();
КонецПроцедуры // ЗагрузитьНаСервере()

