
#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Чтение", Метаданные.Справочники.ШаблоныДоговоров) Тогда
		// Текст договора
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Справочник.Договора";	
		КомандаПечати.Идентификатор = "Договор";
		КомандаПечати.Представление = НСтр("ru = 'Договор'");
		КомандаПечати.Обработчик    = "ПечатьДоговоровКлиент.ВыполнитьКомандуПечатиТекстаДоговора";
		//КомандаПечати.СписокФорм    = "ФормаЭлемента,ФормаСпискаОбщая";
	КонецЕсли;
	
		
КонецПроцедуры

#КонецОбласти

// Возвращает структуру с перечнем полей, которые могут быть поставлены в текст 
// договора по данным из справочника "Договоры контрагентов".
//
Функция ПодготовитьПараметрыПечатиТекстаДоговора(ДоговорКонтрагента) Экспорт

	РеквизитыДоговора 	= ОбщееНазначение.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, 
		"Владелец, Организация, Дата, Номер, СрокДействия, ВидДоговора, ВалютаВзаиморасчетов,
		|УстановленСрокОплаты, СрокОплаты,
		|Руководитель, ЗаРуководителяПоПриказу, ДолжностьРуководителя, 
		|РуководительКонтрагента, ЗаРуководителяКонтрагентаПоПриказу, ДолжностьРуководителяКонтрагента,
		|ПолРуководителяКонтрагента");
		
	// Дополнительные поля
	РеквизитыДоговора.Вставить("РуководительФИО", ""); // Фамилия Имя Отчество
	РеквизитыДоговора.Вставить("РуководительПол", ""); // Пол физического лица

	ДатаСреза = ?(ЗначениеЗаполнено(РеквизитыДоговора.Дата), РеквизитыДоговора.Дата, ТекущаяДатаСеанса());

	// Если срок оплаты не указан в самом договоре, берем его из константы.
	Если НЕ РеквизитыДоговора.УстановленСрокОплаты Тогда
		Если РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
			ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку
			ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			РеквизитыДоговора.Вставить("СрокОплаты", Константы.СрокОплатыПоставщикам.Получить());
		Иначе
			РеквизитыДоговора.Вставить("СрокОплаты", Константы.СрокОплатыПокупателей.Получить());
		КонецЕсли;
	КонецЕсли;

	//Если ЗначениеЗаполнено(РеквизитыДоговора.Руководитель) Тогда
	//	ДанныеФизЛица = УчетЗарплаты.ПредставлениеФизическогоЛица(РеквизитыДоговора.Руководитель, ДатаСреза);
	//	Если ЗначениеЗаполнено(ДанныеФизЛица.ФИОПолные) Тогда
	//		РеквизитыДоговора.Вставить("РуководительФИО", ДанныеФизЛица.ФИОПолные);
	//	Иначе
	//		РеквизитыДоговора.Вставить("РуководительФИО", 
	//			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДоговора.Руководитель, "Наименование"));
	//	КонецЕсли;
	//	
	//Иначе
	//	ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(
	//		РеквизитыДоговора.Организация, ДатаСреза, Неопределено);
	//	
	//	РеквизитыДоговора.Вставить("Руководитель", 		ОтветственныеЛица.Руководитель);
	//	РеквизитыДоговора.Вставить("РуководительФИО", 	ОбщегоНазначенияБПВызовСервера.ПолучитьФамилиюИмяОтчество(
	//														ОтветственныеЛица.РуководительФИО.Фамилия, 
	//														ОтветственныеЛица.РуководительФИО.Имя,
	//														ОтветственныеЛица.РуководительФИО.Отчество,
	//														Ложь));
	//	
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.Руководитель) Тогда
		РеквизитыДоговора.Вставить("РуководительПол", 
			ОбщееНазначение.ЗначениеРеквизитаОбъекта(РеквизитыДоговора.Руководитель, "Пол"));
	КонецЕсли;
	
	Возврат РеквизитыДоговора;

КонецФункции
 