Процедура СоздатьДокументРеализацияТоваров(Склад,ВидЦены,СразуПроводитьДокумент,Таблица) Экспорт
	// Создаем документ Реализация товаров
	РеализацияТоваров = Документы.РеализацияТоваров.СоздатьДокумент();
	РеализацияТоваров.Дата = ТекущаяДата();
	РеализацияТоваров.Склад = Склад;

	Для Каждого Строка Из Таблица Цикл
		НоваяСтрока = РеализацияТоваров.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.ЦенаРеализации = Строка.Цена;
		НоваяСтрока.Стоимость = Строка.Стоимость;
		НоваяСтрока.СтоимостьСоСкидкой = Строка.Стоимость;
	КонецЦикла;	
	Если СразуПроводитьДокумент Тогда
		РеализацияТоваров.Покупатель = Справочники.Контрагенты.ЭталонныйПокупатель;
		РеализацияТоваров.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		РеализацияТоваров.Записать();
	КонецЕсли;

КонецПроцедуры