Функция ОбнулитьПлановыеНачисленияУдержания(ДанныеДокумента, Движения) Экспорт
	Подразделение = ДанныеДокумента.Подразделение;	
	Сотрудник = ДанныеДокумента.Сотрудник;	
	Дата = ДанныеДокумента.Дата;	
	МоментВремени = ДанныеДокумента.МоментВремени;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановыеНачисленияСрезПоследних.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисления.СрезПоследних(
	|			&Момент,
	|			Сотрудник = &Сотрудник
	|				И Подразделение = &Подразделение) КАК ПлановыеНачисленияСрезПоследних
	|ГДЕ
	|	ПлановыеНачисленияСрезПоследних.Значение <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеУдержанияСрезПоследних.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеУдержания.СрезПоследних(
	|			&Момент,
	|			Сотрудник = &Сотрудник
	|				И Подразделение = &Подразделение) КАК ПлановыеУдержанияСрезПоследних
	|ГДЕ
	|	ПлановыеУдержанияСрезПоследних.Значение <> 0";
	
	Запрос.УстановитьПараметр("Момент", МоментВремени);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда
			
			Запись = Движения.ПлановыеНачисления.Добавить();
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
			
			Запись = Движения.ПлановыеУдержания.Добавить();
			
		Иначе
			
			Сообщить("Странный ВР");
			Продолжить;
			
		КонецЕсли; 
		
		Запись.Период = Дата;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = Подразделение;
		Запись.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		Запись.Значение = 0;
		
	КонецЦикла;	
	
КонецФункции // ОбнулитьПлановыеНачисленияУдержания()

Функция ОпределитьПодразделениеСотрудника(Сотрудник,Момент) Экспорт
	Цех = Справочники.Подразделения.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Подразделение
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Момент, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияРаботников.Работает);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цех =ВыборкаДетальныеЗаписи.Подразделение;
	КонецЦикла;
	
	
	Возврат Цех;
КонецФункции
 
Функция Обнулить(СтруктураДанных,Движения)
Сотрудник =СтруктураДанных.Сотрудник;
Подразделение =СтруктураДанных.Подразделение;
МоментВремени =СтруктураДанных.МоментВремени;
Дата =СтруктураДанных.Дата;

Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеНачисленияСрезПоследних.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисления.СрезПоследних(
		|			&Момент,
		|			Сотрудник = &Сотрудник
		|				И Подразделение = &Подразделение) КАК ПлановыеНачисленияСрезПоследних
		|ГДЕ
		|	ПлановыеНачисленияСрезПоследних.Значение <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПлановыеУдержанияСрезПоследних.ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеУдержания.СрезПоследних(
		|			&Момент,
		|			Сотрудник = &Сотрудник
		|				И Подразделение = &Подразделение) КАК ПлановыеУдержанияСрезПоследних
		|ГДЕ
		|	ПлановыеУдержанияСрезПоследних.Значение <> 0";

	Запрос.УстановитьПараметр("Момент", МоментВремени);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда
		
			Запись = Движения.ПлановыеНачисления.Добавить();
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
			
			Запись = Движения.ПлановыеУдержания.Добавить();
			
		Иначе
			
			Сообщить("Странный ВР");
			Продолжить;
		
		КонецЕсли; 
		
		Запись.Период = Дата;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = Подразделение;
		Запись.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		Запись.Значение = 0;
		
	КонецЦикла;	

КонецФункции // Обнулить()
 