
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МакетИгровогоПоля = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетПоля");
	МакетИгровогоПоля.АвтоМасштаб = Истина;
	ОсновноеПолеИгры.Вывести(МакетИгровогоПоля);
КонецПроцедуры

#Область Мишень
&НаКлиенте
Процедура АктивизироватьМишени()
	//Координаты блоков по Х
	Блок_Х = 2;
	Счетчик_Х = 0;
	МассивБлоковПо_Х = Новый Массив;
	Пока Блок_Х <= 15 Цикл
		МассивБлоковПо_Х.Добавить(Блок_Х);
		Блок_Х = Блок_Х +4;
	КонецЦикла;	
	 
	 НачальнаяКоордината =3;
	 
	 Количество_Координат_У = 48;
	  Координата_У = 3;
	  Для Каждого Координата_Х из МассивБлоковПо_Х Цикл
		  Блок_У = Координата_У;
		  Счетчик_У = 0;
		  Пока Координата_У <= Количество_Координат_У Цикл
			  Если Блок_У < Количество_Координат_У Тогда
				  Точка = Мишени.Добавить();
				  Точка.Х = Координата_Х;
			  	  Точка.У = Блок_У;
			  КонецЕсли;
			  Блок_У = Блок_У +1;
			  Счетчик_У = Счетчик_У + 1;
			  Если Счетчик_У = 3 Тогда
				  Блок_У = Блок_У + 3;
				  Счетчик_У = 0;
			  КонецЕсли; 	  
			  Координата_У = Координата_У +1;
		  КонецЦикла;
		  Координата_У = НачальнаяКоордината + 3;
		  НачальнаяКоордината = НачальнаяКоордината + 3;
		  Количество_Координат_У = Количество_Координат_У - 3;
	  КонецЦикла;
	 ПоказатьМишениНаИгровомПоле(); 
КонецПроцедуры	

&НаКлиенте
Процедура ПоказатьМишениНаИгровомПоле()
	Для Каждого Точка Из Мишени Цикл 
		Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
		Область.ЦветФона = Новый Цвет(0,150,70);
	КонецЦикла;	
	
КонецПроцедуры	



#КонецОбласти

#Область Стрелок
&НаКлиенте
Процедура АктивизироватьСтрелка()
	Стрелок.Очистить();
	Для Счетчик = 23 по 27 Цикл
		Точка = Стрелок.Добавить();
		Точка.Х = 50;
		Точка.У = Счетчик;
	КонецЦикла;
	ПоказатьСтрелкаНаИгравомПоле();
КонецПроцедуры	
&НаКлиенте
Процедура  ДвижениеСтрелка(СмещениеУ)

	Для Каждого НоваяТочка Из Стрелок Цикл
		//НоваяТочка.Х = ДвижениеХ;
		НоваяТочка.У = НоваяТочка.У + СмещениеУ;	
	КонецЦикла;	
КонецПроцедуры	
&НаКлиенте
Процедура ПоказатьСтрелкаНаИгравомПоле()
	Для Каждого Точка из Стрелок Цикл
		Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
		Область.ЦветФона = Новый Цвет(255,153,0);
	КонецЦикла;
КонецПроцедуры	
&НаКлиенте
Процедура ОтображениеСтрелкаНаИгровомПоле(СмещениеУ=0)
	//убираем след после движения
	Если СмещениеУ <> 0 Тогда 
		Для Каждого Точка из Стрелок Цикл
			Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
			Область.ЦветФона = Новый Цвет(153,204,255);
		КонецЦикла;
	КонецЕсли;	
	// Алгоритм обработки движения
	ДлинаСтрелка = Стрелок.Количество();
	Если СмещениеУ > 0 Тогда
		  ДвижениеСтрелка(СмещениеУ);
	ИначеЕсли СмещениеУ < 0 Тогда
		 ДвижениеСтрелка(СмещениеУ);
	КонецЕсли;	
	
	//отображение стрелка на поле
	Для Каждого Точка из Стрелок Цикл
		Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
		Область.ЦветФона = Новый Цвет(255,153,0);
	КонецЦикла;	
КонецПроцедуры
	
#КонецОбласти

#Область Снаряд
&НаКлиенте
Процедура Выстрел()
	ОтображениеСнарядаНаИгровомПоле(ДвижениеСнаряядаХ);
	ПодключитьОбработчикОжидания("Выстрел",1-СкоростьИгры*0.1,Истина);
КонецПроцедуры
&НаКлиенте
Процедура ОтображениеСнарядаНаИгровомПоле(СмещениеХ=0)
	Если СмещениеХ <> 0 Тогда
		Для Каждого Точка из Снаряд Цикл
			Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
			Область.ЦветФона = Новый Цвет(153,204,255);
		КонецЦикла;
	КонецЕсли;
	Если СмещениеХ > 0 Тогда
		 ДвижениеСнаряда(СмещениеХ);
	ИначеЕсли СмещениеХ < 0 Тогда
		 ДвижениеСнаряда(СмещениеХ);
	КонецЕсли;
	Для Каждого Точка из Снаряд Цикл
		Область = ОсновноеПолеИгры.Область(Точка.Х,Точка.У);
	 	Область.ЦветФона = Новый Цвет(255,0,0); // красный
	 КонецЦикла;	
 КонецПроцедуры	
 &НаКлиенте
 Процедура ДвижениеСнаряда(СмещениеХ)
	 Если Снаряд.Количество()> 0 Тогда
		 Снаряд.Удалить(0);
	 КонецЕсли;
	 НоваяТочка = Снаряд.Вставить(0);
	 НоваяТочка.Х = СмещениеХ;
	 НоваяТочка.У = ДвижениеСнаряядаУ;
 КонецПроцедуры	 
 &НаКлиенте
Процедура АктивизирокатьСаряд()
	//НоваяТочка = Снаряд.Добавить();
	//НоваяТочка.Х = ТочкаВыстрелаХ;
	//НоваяТочка.У = ТочкаВыстрелаУ; 
КонецПроцедуры	 
 #КонецОбласти

#Область УправлениеДвижением
&НаКлиенте
Процедура ДвижениеВЛево(Команда)
	//ДвижениеХ = 0;   
	ДвижениеУ = -1;
	ОтображениеСтрелкаНаИгровомПоле(ДвижениеУ);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеВПраво(Команда)
	//ДвижениеХ = 0;   
	ДвижениеУ = 1; 
	ОтображениеСтрелкаНаИгровомПоле(ДвижениеУ);
КонецПроцедуры
&НаКлиенте
Процедура Стрельба(Команда)
	ИндексВыстрела = Окр((Стрелок.Количество())/2,0,0);
	АктивизирокатьСаряд();
	ДвижениеСнаряядаХ = -1;
	ДвижениеСнаряядаУ = Стрелок[ИндексВыстрела].У - 1;
	
	
	ОтображениеСнарядаНаИгровомПоле(ДвижениеСнаряядаХ);
	ПодключитьОбработчикОжидания("Выстрел",1-СкоростьИгры*0.1,Истина);
КонецПроцедуры	
#КонецОбласти

&НаКлиенте
Процедура СтартИргы(Команда)
	ДвижениеХ = 50;
	СкоростьИгры = 0; 
	КонецИгры = Ложь;

	АктивизироватьМишени();
	//ПоказатьМишениНаИгровомПоле();
	АктивизироватьСтрелка();
    
	//ПодключитьОбработчикОжидания("Игра",1-СкоростьИгры*0.1,Истина);

КонецПроцедуры


//&НаКлиенте
//Процедура Игра()
//	ОтображениеСтрелкаНаИгровомПоле(ДвижениеУ);
//	//ПодключитьОбработчикОжидания("Игра",1-СкоростьИгры*0.1,Истина);
//	Если Не КонецИгры Тогда   
//		//ПодключитьОбработчикОжидания("Игра",1-СкоростьИгры*0.1,Истина); 
//	Иначе
//		ПоказатьПредупреждение(Новый ОписаниеОповещения("ИграЗавершение", ЭтотОбъект), "GAME OVER");
//	КонецЕсли;

//КонецПроцедуры	
	