
&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере(Документ,КаталогЗагрузки);
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(Документ,КаталогЗагрузки)

	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(КаталогЗагрузки+"\Data.xml");
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Root");
	
	ЗаписатьXML(Запись, Документ.ПолучитьОбъект());
	
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть();
КонецПроцедуры // ВыгрузитьНаСервере(Документ)()


&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере(КаталогЗагрузки);
КонецПроцедуры
 

&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере(КаталогЗагрузки)
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(КаталогЗагрузки+"\Data.xml");
	Выполнять = Истина;
	Пока Выполнять Цикл
		Если ВозможностьЧтенияXML(Чтение) Тогда
			// чтение содержимого элемента
			
			Объект = ПрочитатьXML(Чтение);
			Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеТоваровИУслуг") Тогда
				Объект.Записать();
			КонецЕсли; 
		Иначе
			Выполнять = Чтение.Прочитать();
		КонецЕсли;
	КонецЦикла; 
	Чтение.Закрыть();
КонецПроцедуры // ЗагрузитьНаСервере()


&НаСервереБезКонтекста
Процедура ВыгрузитьРазличныеТипыНаСервере(Документ,КаталогЗагрузки)
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(КаталогЗагрузки+"\Data1.xml");
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Root");
	ЗаписатьXML(Запись, "Привет");
	ЗаписатьXML(Запись, 777);
	ЗаписатьXML(Запись, ТекущаяДата());
	
	ЗаписатьXML(Запись, Документ);
	ЗаписатьXML(Запись, Документ.ПолучитьОбъект());
	
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьРазличныеТипы(Команда)
	ВыгрузитьРазличныеТипыНаСервере(Документ,КаталогЗагрузки);
КонецПроцедуры
 &НаКлиенте
Процедура КаталогЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Фильтр="Все файлы(*.*)|*.*";	
	ЗаголовокДиалога ="Выберите путь для отображения файлов";
	ТекКаталог = КаталогЗагрузки;
	КаталогЗагрузки=РаботаСФайламиКлиент.ВыборФайловИКаталогов("Каталог",Фильтр,ЗаголовокДиалога);
	
КонецПроцедуры
 