// Возвращает структуру с пустым значением полей, которая сохраняется 
// в реквизите Шаблон как ХранилищеЗначения.
//
Функция ПустаяСтруктураШаблонаДоговора() Экспорт

	Вложения = Новый Структура();

	Результат = Новый Структура();
	Результат.Вставить("ТекстHTML", "");
	Результат.Вставить("Вложения", 	Вложения);
	
	Возврат Результат;

КонецФункции

// Возвращает данные шаблона из хранилища.
//
Функция ДанныеШаблонаДоговора(ШаблонДоговора) Экспорт

	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ШаблонДоговора) Тогда
		ШаблонХранилище = ОбщееНазначение.ЗначениеРеквизитаОбъекта(ШаблонДоговора, "ШаблонХранилище");
		Если ТипЗнч(ШаблонХранилище) = Тип("ХранилищеЗначения") Тогда
			Результат = ШаблонХранилище.Получить();
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Результат = ПустаяСтруктураШаблонаДоговора();
	КонецЕсли;

	Возврат Результат;

КонецФункции
