
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движение = Движения.ДополнительныеНачисления.Добавить();
	Движение.Сторно = Сторно;
	Движение.ВидРасчета = ВидРасчета;
	Движение.ПериодРегистрации = ПериодРегистрации;
	Движение.БазовыйПериодНачало = БазовыйПериодНачало;
	Движение.БазовыйПериодКонец = БазовыйПериодКонец;
	Движение.Сотрудник = Сотрудник;
	Движение.Подразделение = Подразделение;
	Движение.Размер = Размер;
	Движения.ДополнительныеНачисления.Записать();
	Движения.Записать();	
	//РасчетЗП.РассчитатьРегистрРасчета(Движения.ДополнительныеНачисления, Отказ);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.Размер,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза КАК База,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.ВидРасчета.СпособРасчета КАК Способ
	               |ПОМЕСТИТЬ ДанныеБезГруппировки
	               |ИЗ
	               |	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
	               |			&Измерения,
	               |			&Измерения,
	               |			,
	               |			Регистратор = &Ссылка
	               |				И ВидРасчета.СпособРасчета В (&Способы)) КАК ДополнительныеНачисленияБазаОсновныеНачисления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДополнительныеНачисленияБазаДополнительныеНачисления.НомерСтроки,
	               |	ДополнительныеНачисленияБазаДополнительныеНачисления.Размер,
	               |	ДополнительныеНачисленияБазаДополнительныеНачисления.РезультатБаза,
	               |	ДополнительныеНачисленияБазаДополнительныеНачисления.ВидРасчета.СпособРасчета
	               |ИЗ
	               |	РегистрРасчета.ДополнительныеНачисления.БазаДополнительныеНачисления(
	               |			&Измерения,
	               |			&Измерения,
	               |			,
	               |			Регистратор = &Ссылка
	               |				И ВидРасчета.СпособРасчета В (&Способы)) КАК ДополнительныеНачисленияБазаДополнительныеНачисления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеБезГруппировки.НомерСтроки,
	               |	ДанныеБезГруппировки.Размер,
	               |	СУММА(ДанныеБезГруппировки.База) КАК База,
	               |	ДанныеБезГруппировки.Способ
	               |ИЗ
	               |	ДанныеБезГруппировки КАК ДанныеБезГруппировки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеБезГруппировки.НомерСтроки,
	               |	ДанныеБезГруппировки.Способ,
	               |	ДанныеБезГруппировки.Размер";
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Измерения.Добавить("Подразделение");
	
	Способы = Новый Массив;
	Способы.Добавить(Перечисления.СпособыРасчета.Процентом); 
	Запрос.УстановитьПараметр("Способы", Способы);
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ДополнительныеНачисления.Премия);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Поиск = Новый Структура("НомерСтроки");
	Набор = Движения.ДополнительныеНачисления;
	Процентом = Перечисления.СпособыРасчета.Процентом;
	
	Для каждого Запись Из Набор Цикл
		Поиск.НомерСтроки = Запись.НомерСтроки;
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Поиск) Тогда
			Если Выборка.Способ = Процентом Тогда
				Запись.Результат = Запись.Размер*Выборка.База/100*?(Запись.Сторно, -1, 1);
			КонецЕсли; 
		КонецЕсли; 
	
	КонецЦикла; 

	
	Набор.Записать(,Истина);
	

	
	
КонецПроцедуры
