Функция ПолучитьСписокОрганизацийПользователя(ТекПользователь)  
	МассивОрганизаций=Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокДоступныхОрганизаций.Организация
	|ИЗ
	|	РегистрСведений.СписокДоступныхОрганизаций КАК СписокДоступныхОрганизаций
	|ГДЕ
	|	СписокДоступныхОрганизаций.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОрганизаций.Добавить(ВыборкаДетальныеЗаписи.Организация);
	КонецЦикла;
	
	
	
	Возврат  МассивОрганизаций;
КонецФункции // ПолучитьСписокОрганизацийПользователя()


Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ПараметрыСеанса.ОсновнаяОрганизация = Константы.НазваниеОрганизации.Получить();
	РаботаСПользователями.ОпределитьТекущегоПользователя();
	ПараметрыСеанса.ИспользоватьОграничениеДоступаКДанным = Константы.ИспользоватьОграничениеДоступаКДанным.Получить();
	
	Если ПараметрыСеанса.ТекущийПользователь.ОграничиватьДоступПоОрганизациям Тогда
		МассивОрганизаций=ПолучитьСписокОрганизацийПользователя(ПараметрыСеанса.ТекущийПользователь) ;
		ПараметрыСеанса.ИспользоватьОграничениеПоПользователю=Истина;
	Иначе
		ПараметрыСеанса.ИспользоватьОграничениеПоПользователю=Ложь;
		
	КонецЕсли; 
	
	//ПараметрыСеанса.ГруппаОрганизацийДляОграниченияДоступа = Новый ФиксированныйМассив(МассивОрганизаций);   
	
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
КонецПроцедуры
