&НаСервереБезКонтекста
Функция ПолучитьОстаток(Товар, Дата)
	Отбор  = Новый Структура("Номенклатура",Товар ); 

	Если ЗначениеЗаполнено(Дата) Тогда
		
		Граница = Новый Граница (КонецДня(Дата), ВидГраницы.Включая);
		
		Таблица =РегистрыНакопления.ОстаткиНаСкладе.Остатки(Граница,Отбор);
		
	Иначе
		Таблица =РегистрыНакопления.ОстаткиНаСкладе.Остатки(,Отбор);
		
	КонецЕсли; 
	
	Возврат Таблица.Итог("Количество");
КонецФункции // ПолучитьОстаток()
&НаСервереБезКонтекста
Функция ПолучитьКлючНаСервере(СтруктураКлюча)
	Возврат  РегистрыСведений.ЦеныПоступления.СоздатьКлючЗаписи(СтруктураКлюча);
КонецФункции // ПолучитьКлючНаСервере()

&НаСервере
Процедура СоздатьУслугиДляСвоихНаСервере()
	ПоискСправочника = Справочники.Номенклатура.НайтиПоНаименованию("Услуги для своих");
	Если ПоискСправочника.Пустая() Тогда
		НовыйСправочник = Справочники.Номенклатура.СоздатьГруппу();
		НовыйСправочник.Наименование = "Услуги для своих";
		НовыйСправочник.Записать();
		НоваяУслуга  = Справочники.Номенклатура.СоздатьЭлемент();
		НоваяУслуга.Родитель = НовыйСправочник.Ссылка;
		НоваяУслуга.Наименование  = "Покупка";
		НоваяУслуга.Записаит();

	КонецЕсли;	
	КонецПроцедуры

&НаКлиенте
Процедура СоздатьУслугиДляСвоих(Команда)
	СоздатьУслугиДляСвоихНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбойтиСправочникНаСервере()
	Выборка = Справочники.Номенклатура.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Наименование);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОбойтиСправочник(Команда)
	ОбойтиСправочникНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПоказатьОстатокПоСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОстатокПоСтроке()
	Остаток=0;
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		
	Иначе
		Товар =Элементы.Список.ТекущаяСтрока; 
		Остаток = ПолучитьОстаток(Товар,НаДату);
		
	КонецЕсли; 	
	
	
КонецПроцедуры // ПоказатьОстатокПоСтроке()

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	ПоказатьОстатокПоСтроке();
КонецПроцедуры
&НаКлиенте
Процедура ИсторияЦен(Команда)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат
	Иначе
		
		
		
		//Ссылка = Элементы.Список.ТекущаяСтрока;
		//СтрукураПараметры  = Новый структура("Отбор");
		//СтруктураОтбор= Новый Структура("Товар",Ссылка );
		//СтрукураПараметры.Отбор = СтруктураОтбор;
		//ОткрытьФорму("РегистрСведений.ЦеныПоступления.ФормаСписка",СтрукураПараметры,,Истина); 
		// открыть с позиционированием на строке
		Ссылка = Элементы.Список.ТекущаяСтрока;
		СтрукураПараметры  = Новый структура("Отбор,ТекущаяСтрока");
		СтруктураОтбор= Новый Структура("Товар",Ссылка );
		СтруктураКлюча = новый структура("Период,Товар",Дата(2015,01,01),Ссылка);
		Ключ = ПолучитьКлючНаСервере(СтруктураКлюча);
		СтрукураПараметры.Отбор = СтруктураОтбор;
		СтрукураПараметры.ТекущаяСтрока = Ключ;
		ОткрытьФорму("РегистрСведений.ЦеныПоступления.ФормаСписка",СтрукураПараметры,,Истина); 
		
		
	КонецЕсли; 	                             
КонецПроцедуры


&НаКлиенте
Процедура СписокНоммменклатуры(Команда)
	Форма = ПолучитьФорму("Отчет.Пример4СписокНоменклатуры.Форма.ФормаОтчета");
	Форма.Открыть();
КонецПроцедуры
&НаСервереБезКонтекста
Функция  ВывестиСписокНоменклатуры()
	//В качестве схемы компоновки данных используем макет отчета "СписокНоменклатуры"
	СхемаКомпановкиДанных = Отчеты.Пример4СписокНоменклатуры.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	// получим настройки по умолчанию
	Настройки = СхемаКомпановкиДанных.НастройкиПоУмолчанию;
	
	//Сформируем макет компановки данных
	КомпановщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпанови = КомпановщикМакета.Выполнить(СхемаКомпановкиДанных,Настройки);
	
	//Выводим компановку данных
	ПроцессорКомпановкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановкиДанных.Инициализировать(МакетКомпанови);
	
	//Выведем результат компановки в табличный документ
	ДокументРезультат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);  
	ПроцессорВывода.Вывести(ПроцессорКомпановкиДанных);
	
	Возврат ДокументРезультат;
КонецФункции	

&НаКлиенте
Процедура СписокНоммменклатуры2(Команда)
	Результат = ВывестиСписокНоменклатуры();  
	Результат.ОтображатьСетку = Ложь;
	Результат.ОтображатьЗаголовки = Ложь;
	Результат.Показать();
КонецПроцедуры

