
&НаСервере
Процедура НайтиДальнийСкладНаСервере()
	ПоискСправочника = Справочники.Склады.НайтиПоНаименованию("Дальний склад");
	Если Не ПоискСправочника.Пустая() Тогда 
		Объект = ПоискСправочника.ПолучитьОбъект();
		Объект.Оптовый = Истина;
		Объект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиДальнийСклад(Команда)
	НайтиДальнийСкладНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьДальнийСкладНаСервере()
	ПоискСправочника = Справочники.Склады.НайтиПоНаименованию("Дальний склад");
	Если Не ПоискСправочника.Пустая() Тогда
		Если ПоискСправочника.Оптовый = Истина Тогда 
		Объект = ПоискСправочника.ПолучитьОбъект();
		Объект.ПометкаУдаления = Истина;
		Объект.Записать();
        КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДальнийСклад(Команда)
	УдалитьДальнийСкладНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиОптовыйСкладНаСервере()
	НайденныйСклад = Справочники.Склады.НайтиПоРеквизиту("Оптовый",Истина);
	Если ЗначениеЗаполнено(НайденныйСклад) Тогда
		Сообщить(НайденныйСклад);
		
	Иначе
		Сообщить("Склад обтовый не найден");
	КонецЕсли;	
	Отбор = Новый Структура("Оптовый",Истина);
	Выборка = Справочники.Склады.Выбрать(,,Отбор);    // неработает
	Пока Выборка.Следующий() Цикл
		 Сообщить("Оптовый склад "+ Выборка.Наименование);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиОптовыйСклад(Команда)
	НайтиОптовыйСкладНаСервере();
КонецПроцедуры
