Функция ВостановитьДатуJSON(Свойство,Значение,ДополнительныеПараметры) Экспорт
	Если Свойство = "ТекДата" Тогда
	
		Возврат ПрочитатьДатуJSON(Формат(Значение,"ЧГ="),ФорматДатыJSON.JavaScript);
	
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	//Путь = Константы.ПутьКФайлу.Получить()+"\";
	ПутьКФайлу =  "E:\БАЗА 1С\Skillbox1\Файлы внешние\Файлы Для Выгрузки\";
	JSONЧтение = Новый ЧтениеJSON;
	JSONЧтение.ОткрытьФайл(ПутьКФайлу+"TestStruktura.json");
	// Варианты чтения данных
	//1
	//ДанныеJSON = ПрочитатьJSON(JSONЧтение,Ложь);
	//2
	// на момент выгрузки нужно знать в каком формате представлена дата
	//ДанныеJSON = ПрочитатьJSON(JSONЧтение,Ложь,"ТекДата",ФорматДатыJSON.JavaScript);
	//3
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("ТекДата");
	ДанныеJSON = ПрочитатьJSON(JSONЧтение,Ложь,,,"ВостановитьДатуJSON",ЭтаФорма,,Реквизиты);
	JSONЧтение.Закрыть();
	Для Каждого Строка Из ДанныеJSON Цикл
		Текст = Текст+ "  " + Строка.Ключ + " - "	+ Строка.Значение + Символы.ПС;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
