&НаКлиенте
Функция НОД(Число_m,Число_n)
	m = Число_m;
	n = Число_n;
	ПродолжениеЦикла = Истина;
	//ЧислоШагов = 1;
	Пока ПродолжениеЦикла Цикл
		Если n > m Тогда
			Промежуточное_m	= n;
			n =  m;
			m = Промежуточное_m;
		КонецЕсли;
		
		m = m % n;
		Если  m = 0 Тогда
			//Сообщить("шаг выплняется " + ЧислоШагов+ " раз ");
			Возврат n;	
			ПродолжениеЦикла = Ложь;
		Иначе	
			n = n % m;
			Если n = 0 Тогда 
				//Сообщить("шаг выплняется " + ЧислоШагов+ " раз ");
				Возврат m;
			    ПродолжениеЦикла = Ложь;
			КонецЕсли;	
		КонецЕсли;	

		//ЧислоШагов = ЧислоШагов+1;
	КонецЦикла;	
	        
КонецФункции	

&НаКлиенте
Процедура Расчет(Команда)
	Результат = НОД(Число1,Число2);
КонецПроцедуры
