
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
			Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Удержания.Ссылка
		|ИЗ
		|	ПланВидовРасчета.Удержания КАК Удержания
		|ГДЕ
		|	Удержания.Код = &Код
		|	И Удержания.Ссылка <> &Ссылка";

		
		Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
	
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент с кодом "+Код+" - "+ВыборкаДетальныеЗаписи.Ссылка;
			Сообщение.Сообщить(); 
			
		КонецЦикла;
		
	
	КонецЕсли; 


КонецПроцедуры
