
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.СформироватьПриОткрытии=Истина;  	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок","Приход/Расход номенклатуры");
	Настройки.параметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",'20190101');
	Настройки.параметрыДанных.УстановитьЗначениеПараметра("КонецПериода",'20231231');	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	Настройки.Элементы[0].Значение = '20190101';
	Настройки.Элементы[0].Использование = Истина;
	Настройки.Элементы[1].Значение = '20231231';
	Настройки.Элементы[1].Использование = Истина;	
КонецПроцедуры
