
// Процедура инициализирует глобальную переменную глЗначениеПеременной("глТекущийПользователь").
// Переменная содержит ссылку на элемент справочника "Пользователи", 
// соответствующий текущему пользователю информационной базы.
//
// Параметры:
//  Нет.
//
Процедура ОпределитьТекущегоПользователя() Экспорт
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		ИмяПользователя           = "НеАвторизован";
		ПолноеИмяПользователя     = "Не авторизован";
	Иначе
		ИмяПользователя           = ИмяПользователя();
		
		Если ПустаяСтрока(ПолноеИмяПользователя()) Тогда
			ПолноеИмяПользователя = ИмяПользователя;
		Иначе
			ПолноеИмяПользователя = ПолноеИмяПользователя();
		КонецЕсли;
	КонецЕсли;
	НайденныйПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
	Если ЗначениеЗаполнено(НайденныйПользователь) Тогда
		
		ПараметрыСеанса.ТекущийПользователь = НайденныйПользователь;
		
	Иначе
		ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
		
		ОбъектПользователь.Код          = ИмяПользователя;
		ОбъектПользователь.Наименование = ПолноеИмяПользователя;
		
		Попытка
			ОбъектПользователь.Записать();
			ПараметрыСеанса.ТекущийПользователь = ОбъектПользователь.Ссылка;
		Исключение
			ВызватьИсключение "Пользователь : " + ИмяПользователя + " не был найден в справочнике пользователей. Возникла ошибка при добавлении пользователя в справочник.
			|" + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ИмяПользователя);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		
		ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
		
		ОбъектПользователь.Код          = ИмяПользователя;
		ОбъектПользователь.Наименование = ПолноеИмяПользователя;
		
		Попытка
			ОбъектПользователь.Записать();
			ПараметрыСеанса.ТекущийПользователь = ОбъектПользователь.Ссылка;
		Исключение
			ВызватьИсключение "Пользователь : " + ИмяПользователя + " не был найден в справочнике пользователей. Возникла ошибка при добавлении пользователя в справочник.
			|" + ОписаниеОшибки();
		КонецПопытки;
		
		
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ПараметрыСеанса.ТекущийПользователь = Выборка.Ссылка;
		
	КонецЕсли;
КонецПроцедуры // ОпределитьТекущегоПользователя()

