// Предназначена для получения контактной информации на дату для нескольких объектов.
//
// Параметры:
//    МассивОбъектов - Массив - владельцы контактной информации.
//    ТипыКИ         - Массив - необязательный, используется, если не задан все типы.
//    ВидыКИ         - Массив - необязательный, используется, если не задан все виды.
//    Дата           - Дата   - необязательный, дата с которой действует запись контактной информации,
//                              используется при хранении истории изменения контактной информации.
//                              Если владелец хранит историю изменений, то при несоответствии параметра
//                              дате будет вызвано исключение.
//
// Возвращаемое значение:
//    Таблица значений - результат. Колонки:
//        * Объект        - Ссылка - владелец КИ.
//        * Вид           - СправочникСсылка.ВидыКонтактнойИнформации
//        * Тип           - ПеречислениеСсылка.ТипыКонтактнойИнформации
//        * ЗначенияПолей - Строка - данные значений полей XML.
//        * Значение      - Строка - данные значений полей JSON.
//        * Представление - Строка - представление КИ.
//
Функция КонтактнаяИнформацияОбъектовНаДату(МассивОбъектов, ТипыКИ = Неопределено, ВидыКИ = Неопределено, Дата = Неопределено) Экспорт
	
	//Если Дата = Неопределено Тогда
	//	Дата = ТекущаяДатаСеанса();
	//КонецЕсли;
	//
	//СвязанныеАдресаДляИстории = СвязанныеАдресаДляПолученияИсторическихЗначений();
	//
	//ВидыКИДляЗапроса = МассивВидовКонтактнойИнформацииДляЗапроса(ВидыКИ, СвязанныеАдресаДляИстории);
	//
	//КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
	//	МассивОбъектов,
	//	ТипыКИ,
	//	ВидыКИДляЗапроса);
	//
	//ЗначенияИсторииКонтактнойИнформации = ЗначенияИсторииКонтактнойИнформацииОбъектов(МассивОбъектов, ВидыКИДляЗапроса, Дата);
	//
	//// Если для адреса есть связанный адрес (см. СвязанныеАдресаДляПолученияИсторическихЗначений()),
	//// то нужно заменить его значение на историческое значение связанного адреса,
	//// если текущее значение адреса совпадает с текущим значением связанного адреса.
	//// Например, в форме редактирования Организации можно указать, что фактический адрес совпадает с юридическим.
	//// Для фактического адреса история не ведется, поэтому, если актуальные значения фактического и юридического адреса совпадают,
	//// то в качестве значения фактического адреса на дату нужно использовать значение юридического адреса на дату.
	//ЗаменитьЗначенияДляСвязанныхАдресовНаИсторические(КонтактнаяИнформация, ЗначенияИсторииКонтактнойИнформации, СвязанныеАдресаДляИстории);
	//
	//// Для всех адресов теперь нужно заменить значение на историческое, если оно есть.
	//// Заменять в предыдущем цикле нельзя, т.к. важно сохранить актуальное значение связанного адреса.
	//ЗаменитьЗначенияКонтактнойИнформацииНаИсторические(КонтактнаяИнформация, ЗначенияИсторииКонтактнойИнформации);
	//
	//// Поле Значение может быть не заполнено, если адрес не редактировался в БСП 3.0.1.
	//// В этом случае нужно заполнить его из поля ЗначенияПолей.
	//ЗаполнитьПолеЗначениеЕслиПустое(КонтактнаяИнформация);
	//
	//// Т.к. мы дополнили виды контактной информации связанными адресами, а их могло не быть
	//// в списке требуемых видов КИ, то нам нужно их удалить из результата.
	//ЗапрашиваемыеВидыКИ = МассивВидовКонтактнойИнформации(ВидыКИ);
	//ОставитьТолькоЗапрашиваемыеВидыКонтактнойИнформации(КонтактнаяИнформация, ЗапрашиваемыеВидыКИ);
	//
	//Возврат КонтактнаяИнформация;
	
КонецФункции
