
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НастройкиПечати = ОткрытьФормуМодально("ОбщаяФорма.ПолучитьНастройкиПечати");
	
	СформированныйпечатныйДокумент = ПечатьДокументаИзФормыНаСервереСВС(ПараметрКоманды,НастройкиПечати);
	СформированныйпечатныйДокумент.КоличествоЭкземпляров = НастройкиПечати.КоличествоэкземпляровПечати;
	СформированныйпечатныйДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьДокументаИзФормыНаСервереСВС(ПараметрКоманды,НастройкиПечати)
	Возврат Документы.ПоступлениеТоваров.ПечатьДокументаИзФормыНаСервереСВС(ПараметрКоманды,НастройкиПечати);
КонецФункции	
	