Процедура РаботаетПроцедураМодуляМенеджера () Экспорт
	Сообщить("РаботаетПроцедураМодуляМенеджера");	
КонецПроцедуры

// изминение внешнего вида отображаемой ссылки 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	//Представление = Данные.Код + "-" + Данные.Наименования + "-"+Данные.ЕДРПОУ+
	//			"-"+Данные.Описание;
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры


Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	//Поля.Добавить("Код");
	//Поля.Добавить("Наименования");
	//Поля.Добавить("ЕДРПОУ");
	//Поля.Добавить("Описание");
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры


Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

