
Процедура ПередЗаписью(Отказ)
	//ПроверкаНаДублиВНаименовании =ОбщееНазначение.ПроверкаНаименованияСправочникаНаПовторение(Наименование,"Контрагенты", Ссылка);
	//Если ПроверкаНаДублиВНаименовании Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	Корректор = ПараметрыСеанса.ТекущийПользователь;
	ДатаКорректировки = ТекущаяДата();
КонецПроцедуры

Процедура РаботаетПроцедураМодуля () Экспорт
	Сообщить("РаботаетПроцедураМодуля");	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЭтоГруппа Тогда 
		ОтсрочкаПлатежа = Константы.ОтстрочкаПлатежа.Получить();
		ВалютаВзаиморасчетов = Справочники.Валюты.Долар;
		Признак  = Перечисления.ПризнакКлиента.Организация;
	КонецЕсли;
	Автор = ПараметрыСеанса.ТекущийПользователь;
	ДатаСоздания = ТекущаяДата();
	Если НЕ ЭтоГруппа Тогда
		ВидыОплат = Перечисления.ВидыОплат.Безналичный;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Вариант 1    удалить
	//Если Признак = Перечисления.ПризнакКлиента.ЧастноеЛицо Тогда
	//	 ПорядковыйНомер =  ПроверяемыеРеквизиты.Найти("ЕДРПОУ");
	//	 Если ПорядковыйНомер<> Неопределено Тогда 
	//		  ПроверяемыеРеквизиты.Удалить(ПорядковыйНомер);
	//	 КонецЕсли;	 
	//КонецЕсли;	
	
	//Вариант2     добавить
	//Если Признак = Перечисления.ПризнакКлиента.ЧастноеЛицо Тогда
	//	
	//Иначе
	//	ПроверяемыеРеквизиты.Добавить("ЕДРПОУ");
	//КонецЕсли;
	
	Если Признак=перечисления.ПризнакКлиента.Организация Тогда
		Если ЗначениеЗаполнено(ЕДРПОУ) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка,
			|	Контрагенты.ЕДРПОУ,
			|	Контрагенты.Наименование
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ЕДРПОУ = &ЕДРПОУ
			|	И Контрагенты.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("ЕДРПОУ", ЕДРПОУ);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Отказ = Истина;
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Сообщить(" В справочнике уже существует контрагент с данным ЕДРПОУ "+ЕДРПОУ + " "  +ВыборкаДетальныеЗаписи.ссылка );
				КонецЦикла;
			КонецЕсли; 
			
		КонецЕсли; 
	Иначе	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.ЕДРПОУ,
		|	Контрагенты.Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование = &Наименование
		|	И Контрагенты.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			//Отказ = Истина;
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Сообщить(" Ваш элемент записан, но В справочнике уже существует контрагент с данным Наименованием "+Наименование + " "  +ВыборкаДетальныеЗаписи.ссылка );
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры
