
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РаботникиОрганизаций
	Движения.РаботникиОрганизаций.Записывать = Истина;
	Движение = Движения.РаботникиОрганизаций.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Подразделение = Подразделение;
	Движение.Состояние = Перечисления.СостоянияРаботников.Работает;
	Движение.ТипГрафика = ТипГрафика;

	// регистр ПлановыеНачисления
	Движения.ПлановыеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ПлановыеНачисления.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.Значение = ТекСтрокаНачисления.Значение;
	КонецЦикла;

	// регистр ПлановыеУдержания
	Движения.ПлановыеУдержания.Записывать = Истина;
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.ПлановыеУдержания.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.ВидРасчета = ТекСтрокаУдержания.ВидРасчета;
		Движение.Значение = ТекСтрокаУдержания.Значение;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
