
&НаСервереБезКонтекста
Процедура ДемонстрацияРаботыНаСервере()
	ДокументыСистемы =Метаданные.Документы ;
	Для каждого ДокументСистемы Из ДокументыСистемы Цикл
		
		Сообщить(ДокументСистемы.Имя);	
		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ДемонстрацияРаботы(Команда)
	ДемонстрацияРаботыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументыСистемы =Метаданные.Документы ;
	Для каждого ДокументСистемы Из ДокументыСистемы Цикл
		
		НоваяСтрока = СписокДокументов.Добавить();
		НоваяСтрока.ДокументСистемы = ДокументСистемы.Имя ;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокДокументов.ТекущаяСтрока = Неопределено Тогда
	Иначе
		ЗаполнитьСписокФорм(Элементы.СписокДокументов.ТекущиеДанные.ДокументСистемы);
		
		
		
	КонецЕсли; 
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокФорм(ИмяДокумента)
	СписокФорм.Очистить();
	СвойствоДокумента =Метаданные.Документы.Найти(СокрЛП(ИмяДокумента));
	Для каждого ФормаДокумента Из СвойствоДокумента.Формы Цикл
		НоваяСтрока = СписокФорм.Добавить();
		НоваяСтрока.ИмяФормы =ФормаДокумента.Имя; 
		
		
	КонецЦикла; 	
	
КонецПроцедуры // ()


&НаКлиенте
Процедура СписокФормВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.СписокДокументов.ТекущаяСтрока = Неопределено  Или 
		Элементы.СписокФорм.ТекущаяСтрока = Неопределено
		Тогда
	Иначе
		//ОткрытьФорму("Документ.РеализационнаяНакладная.Форма.ФормаСписка"); 
		ИмяДокумента = СокрЛП(Элементы.СписокДокументов.ТекущиеДанные.ДокументСистемы);
		ИмяФормыДляОткрытия = СокрЛП(Элементы.СписокФорм.ТекущиеДанные.ИмяФормы);
		ОткрытьФорму("Документ."+ИмяДокумента+".Форма."+ИмяФормыДляОткрытия); 
		
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаРеквизитаНаСервере(Ссылка,ИмяРеквизита)
	ЕстьРеквизит = Ложь;
	МетаДокумент = Ссылка.Метаданные();
	Если МетаДокумент.Реквизиты.Найти(СокрЛП(ИмяРеквизита)) <> Неопределено 
		Тогда
		
		ЕстьРеквизит = Истина;
		
		
	КонецЕсли; 
	Возврат ЕстьРеквизит ;
КонецФункции

&НаКлиенте
Процедура ПроверкаРеквизита(Команда)
	Если ПроверкаРеквизитаНаСервере(ДокументДляВыбора,РеквизитДляПроверки) Тогда
		
		Сообщить("Реквизит " + РеквизитДляПроверки+ " присутствует в документе " +ДокументДляВыбора);	
	Иначе	
		Сообщить("Реквизит " + РеквизитДляПроверки+ " отсутствует в документе " +ДокументДляВыбора);	
	КонецЕсли; 
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ОчиститьБазуНаСервере()
	УстановитьПривилегированныйРежим(Истина);	
	Для каждого Регистр Из Метаданные.РегистрыСведений Цикл
		
		Сообщить(Регистр.Имя);
		//
		//НаборЗаписейРегистра = РегистрыСведений[Регистр.Имя].СоздатьНаборЗаписей();
		//НаборЗаписейРегистра.Очистить();
		//Попытка
		//	
		//	НаборЗаписейРегистра.Записать();
		//	
		//	
		//Исключение
		//	
		//КонецПопытки;
		
	КонецЦикла;
	Запрос = Новый Запрос;
	ТексЗапроса = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка,
	|	ПоступлениеТоваровИУслуг.Проведен
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг";
	Для каждого ТекДокумент Из Метаданные.Документы Цикл
		Сообщить("Документ " +  ТекДокумент.Имя);
		Запрос.Текст  = СтрЗаменить(ТексЗапроса,"ПоступлениеТоваровИУслуг",ТекДокумент.Имя);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить(ВыборкаДетальныеЗаписи.ссылка);
			//ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			//Если ВыборкаДетальныеЗаписи.Проведен Тогда
			//	
			//	ТекОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//	
			//КонецЕсли; 
		//ТекОбъект.Удалить();
		КонецЦикла;
	КонецЦикла;
	Запрос = Новый Запрос;
	ПервыйСправочник = Истина;
	Для каждого ТекДокумент Из Метаданные.Справочники Цикл
		ИмяСправочника =   ТекДокумент.Имя;
		//Сообщить("Документ " +  ТекДокумент.Имя);
		//Запрос.Текст  = СтрЗаменить(Запрос.Текст,"Валюты",ТекДокумент.Имя);
		Если ПервыйСправочник Тогда
			//Запрос.Текст  = "ВЫБРАТЬ "+ИмяСправочника+".Ссылка ИЗ Справочник."+ИмяСправочника+" КАК "+ИмяСправочника;

			Запрос.Текст  = 	"ВЫБРАТЬ "+ИмяСправочника+".Ссылка
			|ИЗ
			|	Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
			|ГДЕ
			|	НЕ "+ИмяСправочника+".Предопределенный";
			ПервыйСправочник = Ложь;
			
		Иначе
			Запрос.Текст  = Запрос.Текст +	" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ "+ИмяСправочника+".Ссылка
			|ИЗ
			|	Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
			|ГДЕ
			|	НЕ "+ИмяСправочника+".Предопределенный";
			
			
		КонецЕсли; 
	КонецЦикла;
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить(ВыборкаДетальныеЗаписи.ссылка);
			//ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			//ТекОбъект.Удалить();
		КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);	
КонецПроцедуры // ОчиститьРегистрСервер()


&НаКлиенте
Процедура ОчиститьБазу1(Команда)
	ОчиститьБазуНаСервере();
КонецПроцедуры
