
&НаСервере
Функция  КнопкаНаСервере(ТабДок)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Макет = Отчеты.Модуль11_Задача1_КурсыВалютВ2.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта,
		|	Валюты.Код КАК КодВалюты,
		|	ВЫБОР
		|		КОГДА Валюты.Ссылка = курсыВалют.Валюта
		|			ТОГДА курсыВалют.Курс
		|		ИНАЧЕ ""Не задан""
		|	КОНЕЦ КАК Курс,
		|	ВЫБОР
		|		КОГДА Валюты.Ссылка = курсыВалют.Валюта
		|			ТОГДА курсыВалют.Период
		|		ИНАЧЕ ""Не задан""
		|	КОНЕЦ КАК ДатаУстановкиКурса
		|ИЗ
		|	Справочник.Валюты КАК Валюты,
		|	РегистрСведений.курсыВалют КАК курсыВалют";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	Возврат ТабДок;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

&НаКлиенте
Процедура Кнопка(Команда)
	ТабДок = Новый ТабличныйДокумент;

	ТабДок = КнопкаНаСервере(ТабДок);
	
	ТабДок.Показать();

КонецПроцедуры
