Функция НашаДесериализация(Свойство,Значение,ДополнительныеПараметры) Экспорт
	 Если Свойство = "ТекДата" Тогда
		Возврат ПрочитатьДатуJSON(Формат(Значение,"ЧГ="),ФорматДатыJSON.JavaScript);
	 ИначеЕсли Свойство = "УИД" Тогда
		Возврат Новый УникальныйИдентификатор(Значение);
	 ИначеЕсли Свойство = "Контрагент" Тогда
		Возврат Справочники.Контрагенты.НайтиПоНаименованию(Значение);
	 КонецЕсли;	
КонецФункции	
Функция НашаСериализация(Свойство,Значение,ДополнительныеПараметры,Отказ) Экспорт
	Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		 Возврат Строка(Значение);
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
		  Возврат Строка(Значение.Наименование);
	КонецЕсли;	
КонецФункции	
&НаСервере
Процедура ВыгрузитьСтруктуруНаСервере()
	ФайлJSON = Новый ЗаписьJSON;
	//Путь = Константы.ПутьКФайлу.Получить()+"\";
	Путь =  "E:\БАЗА 1С\Skillbox1\Файлы внешние\Файлы Для Выгрузки\";

	ФайлJSON.ОткрытьФайл(Путь+"TestStruktura.json");
	// ссылки в JSON не передают,так как программе которой передаются данные о ссылках 1С нечего не знает 
	СтруктыраВыгрузки = Новый Структура();
	СтруктыраВыгрузки.Вставить("Код",Объект.Номенклатура.Код);
	СтруктыраВыгрузки.Вставить("Наименование",Объект.Номенклатура.Наименование);
	СтруктыраВыгрузки.Вставить("ВидНоменклатуры",Объект.Номенклатура.ВидНоменклатуры.ИмяПредопределенныхДанных);
	СтруктыраВыгрузки.Вставить("УИД",Объект.СсылкаНаДокумент.УникальныйИдентификатор());
	СтруктыраВыгрузки.Вставить("Контрагент",Объект.СсылкаНаДокумент.Покупатель);
	JSONНастройкиСериализации = Новый НастройкиСериализацииJSON;
	
	ЗаписатьJSON(ФайлJSON,СтруктыраВыгрузки,JSONНастройкиСериализации,"НашаСериализация",ЭтаФорма);
	Сообщить("Данные выгружены "+Путь+"TestStruktura.json");

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСтруктуру(Команда)
	ВыгрузитьСтруктуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	//Путь = Константы.ПутьКФайлу.Получить()+"\";
	ПутьКФайлу =  "E:\БАЗА 1С\Skillbox1\Файлы внешние\Файлы Для Выгрузки\";
	JSONЧтение = Новый ЧтениеJSON;
	JSONЧтение.ОткрытьФайл(ПутьКФайлу+"TestStruktura.json");
	// Варианты чтения данных
	//1
	//ДанныеJSON = ПрочитатьJSON(JSONЧтение,Ложь);
	//2
	// на момент выгрузки нужно знать в каком формате представлена дата
	//ДанныеJSON = ПрочитатьJSON(JSONЧтение,Ложь,"ТекДата",ФорматДатыJSON.JavaScript);
	//3
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("ТекДата");
	Реквизиты.Добавить("УИД");
	Реквизиты.Добавить("Контрагент");
	ДанныеJSON = ПрочитатьJSON(JSONЧтение,Ложь,,,"НашаДесериализация",ЭтаФорма,,Реквизиты);
	JSONЧтение.Закрыть();
	Для Каждого Строка Из ДанныеJSON Цикл
		Текст = Текст+ "  " + Строка.Ключ + " - "	+ Строка.Значение + Символы.ПС;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
