
&НаСервере
Процедура ОтправкаНаСервере()
	#Область ПолучитьУзлы
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПланОбменаУниверсальныеОбменыДанными.Ссылка		КАК Ссылка,
			|	ПланОбменаУниверсальныеОбменыДанными.Код 		КАК Код
			|ИЗ
			|	ПланОбмена.ПланОбменаУниверсальныеОбменыДанными КАК ПланОбменаУниверсальныеОбменыДанными
			|ГДЕ
			|	НЕ ПланОбменаУниверсальныеОбменыДанными.ЭтотУзел";
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаЗаписей = РезультатЗапроса.Выбрать();
		
		ЭтотУзел = ПланыОбмена.ПланОбменаУниверсальныеОбменыДанными.ЭтотУзел();

		
		Пока ВыборкаЗаписей.Следующий() Цикл
			ТекущийУзел = ВыборкаЗаписей.Ссылка;
			ЗаписьXML = Новый ЗаписьXML();  
			ИмяФайла = СтрШаблон("%1\%2_%3.xml",Объект.КаталогОбмена,ЭтотУзел.Код,ТекущийУзел.Код);
            ЗаписьXML.ОткрытьФайл(ИмяФайла);
			ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
			ЗаписьСообщения.НачатьЗапись(ЗаписьXML,ТекущийУзел);
			
			Выборка = ПланыОбмена.ВыбратьИзменения(ТекущийУзел,ЗаписьСообщения.НомерСообщения);
			
			Пока Выборка.Следующий() Цикл
				Данные = Выборка.Получить();
				ЗаписатьXML(ЗаписьXML,Данные);				
			КонецЦикла;                       
			ЗаписьСообщения.ЗакончитьЗапись();
		КонецЦикла;
	
	
	#КонецОбласти
КонецПроцедуры

&НаКлиенте
Процедура Отправка(Команда)
	ОтправкаНаСервере();
КонецПроцедуры
