
&НаСервереБезКонтекста
Процедура ПросмотрСтруктурыБазыНаСервере()
	ТаблицаСтруктурыБазы= ПолучитьСтруктуруХраненияБазыДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрСтруктурыБазы(Команда)
	ПросмотрСтруктурыБазыНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьИтогиПоРегиструНаСервере()
	РегистрыНакопления.ОстаткиТоваров.ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиПоРегистру(Команда)
	ПересчитатьИтогиПоРегиструНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроведениеВМодулеДокументаНаСервере()
	ТекДокОбъект = ПоступлениеТоваровИУслуг.ПолучитьОбъект();
	ТекДокОбъект.ПроведениеВМодуле();
КонецПроцедуры

&НаКлиенте
Процедура ПроведениеВМодулеДокумента(Команда)
	ПроведениеВМодулеДокументаНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДокументыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровИУслуг.Проведен КАК Проведен
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ВыборкаДетальныеЗаписи.Проведен Тогда
			ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			
			ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализационнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализационнаяНакладная
	|ГДЕ
	|	РеализационнаяНакладная.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьКурсНаСервере(НаДату,Валюта,Курс)
	ЗаписьРегистра = РегистрыСведений.Курсы.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Период=НаДату;
	ЗаписьРегистра.Валюта=Валюта;
	ЗаписьРегистра.Курс=Курс;
	ЗаписьРегистра.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКурс(Команда)
	ЗаписатьКурсНаСервере(НаДату,Валюта,Курс);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказатьКурсНаСервере(НаДату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыСрезПоследних.Период,
	|	КурсыСрезПоследних.Валюта,
	|	КурсыСрезПоследних.Курс
	|ИЗ
	|	РегистрСведений.Курсы.СрезПоследних(&НаДату, ) КАК КурсыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить(ВыборкаДетальныеЗаписи.курс);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКурс(Команда)
	ПоказатьКурсНаСервере(НаДату);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыборПоРегистраторуНаСервере(ТекДокумент)
	Выборка= РегистрыНакопления.ОстаткиТоваров.ВыбратьПоРегистратору(ТекДокумент);
	Пока Выборка.Следующий() Цикл
		
		Сообщить(Выборка.Товар);
		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоРегистратору(Команда)
	ВыборПоРегистраторуНаСервере(ПоступлениеТоваровИУслуг);
КонецПроцедуры



&НаКлиенте
Процедура ЗаписатьДокументы(Команда)
	ЗаписатьДокументыНаСервере();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПереформироватьДвиженияНаСервере(Склад)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровИУслуг.Дата КАК Дата,
	|	ПоступлениеТоваровИУслуг.Поставщик КАК Поставщик,
	|	ПоступлениеТоваровИУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровИУслуг.Склад КАК Склад
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма")+ ТекОбъект.Услуги.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Автор = ПараметрыСеанса.ТекущийПользователь;
		Движения.ИтогиПоДокументам.Записать();
		Для Каждого ТекСтрокаТовары Из ТекОбъект.Товары Цикл
			Движение = Движения.ОстаткиНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ВыборкаДетальныеЗаписи.Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Склад = ТекОбъект.Склад;			
		КонецЦикла;	
		Движения.ОстаткиТоваров.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализационнаяНакладная.Ссылка,
	|	РеализационнаяНакладная.Дата,
	|	РеализационнаяНакладная.Покупатель,
	|	РеализационнаяНакладная.Организация,
	|	РеализационнаяНакладная.Склад КАК Склад
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализационнаяНакладная
	|ГДЕ
	|	РеализационнаяНакладная.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ТекОбъект.Склад) Тогда
			ТекОбъект.Склад = Склад;
			ТекОбъект.Записать();
			
		КонецЕсли; 
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Покупатель;
		Движение.Автор = ПараметрыСеанса.ТекущийПользователь;
		Движения.ИтогиПоДокументам.Записать();
		Для Каждого ТекСтрокаТовары Из ТекОбъект.Товары Цикл
			Движение = Движения.ОстаткиНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ВыборкаДетальныеЗаписи.Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение. Характеристика= ТекСтрокаТовары.Характеристика ;
			Движение.Склад = ТекОбъект.Склад;
			Движение.Количество = ТекСтрокаТовары.Количество;  
		КонецЦикла;	
		Движения.ОстаткиТоваров.Записать();
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Счет.Ссылка,
	|	Счет.Дата,
	|	Счет.Контрагент,
	|	Счет.Организация,
	|	Счет.Автор
	|ИЗ
	|	Документ.Счет КАК Счет
	|ГДЕ
	|	Счет.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Автор = ТекОбъект.Автор;
		Движения.ИтогиПоДокументам.Записать();
		
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Возврат.Ссылка,
	|	Возврат.Дата,
	|	Возврат.Контрагент,
	|	Возврат.Организация,
	|	Возврат.Автор
	|ИЗ
	|	Документ.Возврат КАК Возврат
	|ГДЕ
	|	Возврат.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ТекОбъект.Склад) Тогда
			ТекОбъект.Склад = Склад;
			ТекОбъект.Записать();
			
		КонецЕсли; 
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Автор = ТекОбъект.Автор;
		Движения.ИтогиПоДокументам.Записать();
		Для Каждого ТекСтрокаТовары Из ТекОбъект.Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ВыборкаДетальныеЗаписи.Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Склад = ТекОбъект.Склад;
			Движение.Поставщик = ВыборкаДетальныеЗаписи.Контрагент;
			
		КонецЦикла;	
		Движения.ОстаткиТоваров.Записать();
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПереформироватьДвижения(Команда)
	ПереформироватьДвиженияНаСервере(Склад);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВсеОстаткиНаСервере()
	ТаблицаОстатков = РегистрыНакопления.ОстаткиНаСкладе.Остатки();	
	
КонецПроцедуры


&НаКлиенте
Процедура ВсеОстатки(Команда)
	ВсеОстаткиНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыбратьВсеДанныеНаСервере()
	Выборка = РегистрыНакопления.ОстаткиТоваров.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Сообщить(Выборка.Товар);
		
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеДанные(Команда)
	ВыбратьВсеДанныеНаСервере();
КонецПроцедуры

