
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл csv(*.csv)|*.csv|Файл excel(*.xls; *.xlsx)|*.xls; *.xlsx'");
	ДиалогВыбораФайла.Заголовок                   = НСтр("ru='Выберите csv файл|Выберите xlsx файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "csv";  //?
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла              = ПутьКФайлу;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(НазваниеСправочника,ПутьКФайлу)
	ApplicationExcel = Новый COMОбъект("Excel.Application");
	ApplicationExcel.Visible = Истина; // Запущен в фоновом режиме = Ложь, "Видемый" режим = Истина
	ApplicationExcel.Workbooks.Open(ПутьКФайлу);
		
	Если НазваниеСправочника = "Номенклатура" Тогда
		Выборка = Справочники.Номенклатура.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,1).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,2).Value = "Наименование";
		ApplicationExcel.Sheets(1).Cells(1,3).Value = "ВидТовара";
		b = 1;
		c = 2;
		d = 3;
	ИначеЕсли НазваниеСправочника = "Контрагенты" Тогда
		Выборка = Справочники.Контрагенты.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,5).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,6).Value = "Наименование";
		ApplicationExcel.Sheets(1).Cells(1,7).Value = "ИНН";
		ApplicationExcel.Sheets(1).Cells(1,8).Value = "ПолноеЮридическоеНаименование";
		e = 5;
		f = 6;
		g = 7;
		h = 8;
	ИначеЕсли НазваниеСправочника = "Валюты" Тогда
		Выборка = Справочники.Валюты.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,10).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,11).Value = "КодСимвольный";
		ApplicationExcel.Sheets(1).Cells(1,12).Value = "Наименование";
		k = 10;
		l = 11;
		m = 12;
	ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда	
		Выборка = Справочники.Сотрудники.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,14).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,15).Value = "Наименование";
		ApplicationExcel.Sheets(1).Cells(1,16).Value = "Адрес";
		n = 14;
		p = 15;
		q = 16;
	КонецЕсли;
	
	i = 2;
	Пока Выборка.Следующий() Цикл
		Если НазваниеСправочника  = "Номенклатура" Тогда
			ApplicationExcel.Sheets(1).Cells(i,b).Value =Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,c).Value = Выборка.Наименование;
			ApplicationExcel.Sheets(1).Cells(i,d).Value = Выборка.ВидТовара;
		ИначеЕсли  НазваниеСправочника = "Контрагенты" Тогда
			ApplicationExcel.Sheets(1).Cells(i,e).Value = Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,f).Value = Выборка.Наименование;
			ApplicationExcel.Sheets(1).Cells(i,g).Value = Выборка.ИНН;
			ApplicationExcel.Sheets(1).Cells(i,h).Value = Выборка.ПолноеЮридическоеНаименование;
		ИначеЕсли НазваниеСправочника = "Валюты" Тогда	
			ApplicationExcel.Sheets(1).Cells(i,k).Value =  Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,l).Value =  Выборка.КодСимвольный;
			ApplicationExcel.Sheets(1).Cells(i,m).Value =  Выборка.Наименование;
			
		ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда
			ApplicationExcel.Sheets(1).Cells(i,n).Value =  Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,p).Value =  Выборка.Наименование;
			ApplicationExcel.Sheets(1).Cells(i,q).Value =  Выборка.Адрес;
		КонецЕсли;	
		i = i + 1;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере(ВыборСправочника,ПутьКФайлу);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ЗаписатьCSV(ТекстФайла, ИмяФайла)
	КодировкаФайла = КодировкаТекста.Системная;
	ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяФайла,КодировкаФайла);
	ТекстовыйФайлЗапись.ЗаписатьСтроку(ТекстФайла);
	ТекстовыйФайлЗапись.Закрыть();
КонецПроцедуры	
&НаСервереБезКонтекста
Процедура ЗаписатьДанныеВФайлCSV(НазваниеСправочника,ПутьКФайлу)
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстФайлаCSV = "";
	СимволРазделителя = ";";
	
	Если НазваниеСправочника = "Номенклатура" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "Наименование"+ СимволРазделителя + "ВидТовара"+Символы.ПС;
	ИначеЕсли НазваниеСправочника = "Контрагенты" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "Наименование"+ СимволРазделителя + "ИНН"+СимволРазделителя+"ПолноеЮридическоеНаименование"+Символы.ПС;
	ИначеЕсли НазваниеСправочника = "Валюты" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "КодСимвольный"+ СимволРазделителя + "Наименование"+Символы.ПС;
	ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "Наименование"+ СимволРазделителя + "Адрес"+Символы.ПС;
	КонецЕсли;	
	
	Если НазваниеСправочника = "Номенклатура" Тогда
		Выборка = Справочники.Номенклатура.Выбрать();
	ИначеЕсли НазваниеСправочника = "Контрагенты" Тогда
		Выборка = Справочники.Контрагенты.Выбрать();
	ИначеЕсли НазваниеСправочника = "Валюты" Тогда
		Выборка = Справочники.Валюты.Выбрать();
	ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда	
		Выборка = Справочники.Сотрудники.Выбрать();
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		Если НазваниеСправочника  = "Номенклатура" Тогда
			ТекстФайлаCSV  = ТекстФайлаCSV +
			Выборка.Код +СимволРазделителя + Выборка.Наименование + Выборка.ВидТовара+Символы.ПС;
		ИначеЕсли  НазваниеСправочника = "Контрагенты" Тогда
			ТекстФайлаCSV  = ТекстФайлаCSV +
		    Выборка.Код +СимволРазделителя + Выборка.Наименование + СимволРазделителя + Выборка.ИНН + СимволРазделителя + Выборка.ПолноеЮридическоеНаименование+Символы.ПС;
		ИначеЕсли НазваниеСправочника = "Валюты" Тогда	
			ТекстФайлаCSV  =  ТекстФайлаCSV +
		    Выборка.Код +СимволРазделителя+Выборка.КодСимвольный + Выборка.Наименование + Символы.ПС;
		ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда
			ТекстФайлаCSV  = ТекстФайлаCSV +
			Выборка.Код +СимволРазделителя + Выборка.Наименование + Выборка.Адрес+Символы.ПС;
		КонецЕсли;	
	КонецЦикла;	
	
		ЗаписатьCSV(ТекстФайлаCSV,ПутьКФайлу);

КонецПроцедуры	
&НаКлиенте
Процедура ВыгрузитьВCSV(Команда)
	ЗаписатьДанныеВФайлCSV(ВыборСправочника,ПутьКФайлу);
КонецПроцедуры

