
&НаСервереБезКонтекста
Процедура ВыбратьКонтрагентовНаСервере()
	УстановитьПривилегированныйРежим(Истина );
	Выборка =Документы.ПоступлениеТоваров.Выбрать();
	Пока Выборка.Следующий() Цикл
	    Сообщить(Выборка.Поспавщик);
		
	
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь );
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтрагентов(Команда)
	ВыбратьКонтрагентовНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПроверкаРаботыБезопасногоРежимаНаСервере()
	УстановитьБезопасныйРежим(Истина);
	//УстановитьПривилегированныйРежим(Истина );
	Выборка =Документы.ПоступлениеТоваров.Выбрать();
	Пока Выборка.Следующий() Цикл
	    Сообщить(Выборка.Поставщик);
		
	
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаРаботыБезопасногоРежима(Команда)
	ПроверкаРаботыБезопасногоРежимаНаСервере();
КонецПроцедуры

