
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПоступлениеТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Дата,
	|	ПоступлениеТоваров.Заказ,
	|	ПоступлениеТоваров.Номер,
	|	ПоступлениеТоваров.Поставщик,
	|	ПоступлениеТоваров.Склад,
	|	ПоступлениеТоваров.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		Количество,
	|		ЦенаПоступления,
	|		Стоимость
	|	)
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	//Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		//Подвал.Параметры.Заполнить(Выборка);
	    //ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры


Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если РольДоступна("Кладовщик")  Тогда
			ВыбраннаяФорма = "ФормаДокумента1";
			СтандартнаяОбработка =Ложь;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Функция  ПечатьДокументаИзФормыНаСервере(ТекДокумент) Экспорт

	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПоступлениеТоваров.ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Дата =  Формат(ТекДокумент.Дата,"ДЛФ=DDT");
	ОбластьЗаголовок.Параметры.Номер =  ТекДокумент.Номер;
	ТабДок.Вывести(ОбластьЗаголовок);
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Контрагент =  ТекДокумент.Поставщик;
	ОбластьШапка.Параметры.Договор =  ТекДокумент.Договор;
	ОбластьШапка.Параметры.Склад =  ТекДокумент.Склад;
	ТабДок.Вывести(ОбластьШапка);
	ОбластьЗаглавиеТаблицы = Макет.ПолучитьОбласть("ЗаголовокСтрок");
	ТабДок.Вывести(ОбластьЗаглавиеТаблицы);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Сумма = 0;
	Для каждого Строка Из ТекДокумент.Товары Цикл
		ОбластьСтрока.Параметры.Заполнить(Строка);
		ОбластьСтрока.Параметры.Стоимость = Формат(Строка.Стоимость,"ЧЦ=10; ЧДЦ=2; ЧРД=,; ЧН=0.00");
		ОбластьСтрока.Параметры.ЦенаПоступления= Формат(Строка.ЦенаПоступления,"ЧЦ=15; ЧДЦ=2; ЧРД=.");
		ТабДок.Вывести(ОбластьСтрока);
		Сумма = Сумма +  Строка.Стоимость;
	КонецЦикла;
	Сумма1=ТекДокумент.Товары.Итог("Стоимость");
	ОбластьПодвал.Параметры.Автор = ПараметрыСеанса.ТекущийПользователь;
	ОбластьПодвал.Параметры.Сумма =  Формат(Сумма1,"ЧЦ=15; ЧДЦ=2; ЧРД=,");
	ОбластьПодвал.Параметры.СуммаПрописью =  ОбщееНазначение.СуммаПрописью(Сумма);
	//
	ТабДок.Вывести(ОбластьПодвал);  

	Возврат ТабДок;
	
КонецФункции	
	
Функция ПечатьДокументаИзФормыНаСервереСВС(ТекДокумент,НастройкиПечати) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПоступлениеТоваров.ПолучитьМакет("Макет3");	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Дата =  Формат(ТекДокумент.Дата,"ДЛФ=DD");
	ОбластьЗаголовок.Параметры.Номер =  ТекДокумент.Номер;
	ТабДок.Вывести(ОбластьЗаголовок);
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Контрагент =  ТекДокумент.Поставщик;
	ОбластьШапка.Параметры.Договор =  ТекДокумент.Договор;
	ОбластьШапка.Параметры.Склад =  ТекДокумент.Склад;
	ТабДок.Вывести(ОбластьШапка);
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Если НастройкиПечати.ПечататьЦену Тогда
		ОбластьЗаглавиеТаблицы = Макет.ПолучитьОбласть("ЗаголовокСтрок");
		ТабДок.Вывести(ОбластьЗаглавиеТаблицы);
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Сумма = 0;
		Для каждого Строка Из ТекДокумент.Товары Цикл
			ОбластьСтрока.Параметры.Заполнить(Строка);
			ОбластьСтрока.Параметры.Стоимость = Формат(Строка.Стоимость,"ЧЦ=10; ЧДЦ=2; ЧРД=.");
			ОбластьСтрока.Параметры.ЦенаПоступления= Формат(Строка.ЦенаПоступления,"ЧЦ=15; ЧДЦ=2; ЧРД=.");
			ТабДок.Вывести(ОбластьСтрока);
			Сумма = Сумма +  Строка.Стоимость;
		КонецЦикла;
		
	Иначе	
		ОбластьЗаглавиеТаблицыТ = Макет.ПолучитьОбласть("ЗаголовокСтрок|ВТовар");
		ОбластьЗаглавиеТаблицыЦ = Макет.ПолучитьОбласть("ЗаголовокСтрок|ВЦена");
		ОбластьЗаглавиеТаблицыС = Макет.ПолучитьОбласть("ЗаголовокСтрок|ВСумма");
		ТабДок.Вывести(ОбластьЗаглавиеТаблицыТ);
		//ТабДок.Присоединить(ОбластьЗаглавиеТаблицыЦ);
		ТабДок.Присоединить(ОбластьЗаглавиеТаблицыС);
		ОбластьСтрокаТ = Макет.ПолучитьОбласть("Строка|ВТовар");
		//ОбластьСтрокаЦ = Макет.ПолучитьОбласть("Строка|ВЦена");
		ОбластьСтрокаС = Макет.ПолучитьОбласть("Строка|ВСумма");
		Сумма = 0;
		Для каждого Строка Из ТекДокумент.Товары Цикл
			ОбластьСтрокаТ.Параметры.Заполнить(Строка);
			ОбластьСтрокаС.Параметры.Стоимость = Формат(Строка.Стоимость,"ЧЦ=10; ЧДЦ=2; ЧРД=.");
			//ОбластьСтрока.Параметры.ЦенаПоступления= Формат(Строка.ЦенаПоступления,"ЧЦ=15; ЧДЦ=2; ЧРД=.");
			ТабДок.Вывести(ОбластьСтрокаТ);
			ТабДок.Присоединить(ОбластьСтрокаС);
			Сумма = Сумма +  Строка.Стоимость;
		КонецЦикла;
		
	КонецЕсли; 
	Сумма1=ТекДокумент.Товары.Итог("Стоимость");
	ОбластьПодвал.Параметры.Автор = ПараметрыСеанса.ТекущийПользователь;
	ОбластьПодвал.Параметры.Сумма =  Формат(Сумма1,"ЧЦ=15; ЧДЦ=2; ЧРД=,");
	ОбластьПодвал.Параметры.СуммаПрописью =  ОбщееНазначение.СуммаПрописью(Сумма);
	//
	ТабДок.Вывести(ОбластьПодвал); 
	Возврат  ТабДок;
	
	
КонецФункции // ()
