&НаСервере
Функция ПроверкаДублейВРегистреКурсыВалют(Валюта,ДатаКурса)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	курсыВалютСрезПоследних.Валюта КАК Валюта
		|ИЗ
		|	РегистрСведений.курсыВалют.СрезПоследних(&ДатаКурса, Валюта = &Валюта) КАК курсыВалютСрезПоследних
		|ГДЕ
		|	курсыВалютСрезПоследних.Период >= &ДатаКурса";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("ДатаКурса", ДатаКурса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат Истина;	
	КонецЕсли;;
	
	Возврат Ложь;
КонецФункции	
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗагрузитьКурсыВалют();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалют()
	ЗагрузитьВалюты = ОбщееНазначение.ПолучитьЗначениеКонстантыБулево("СоздаватьВалютыАвтоматически");
	
	Соединение = WSСсылки.КурсВалютСсылки.СоздатьWSПрокси("http://web.cbr.ru/","DailyInfo","DailyInfoSoap");
	// Получает тип данных дата, которые используются на веб-сервесе
	// устанавливаем соединение через пространство имен, Из пространства имен берем функцию  GetCursOnDate
	ТипWSПараметра = Соединение.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");
	СегоднешняяДата = Соединение.ФабрикаXDTO.Создать(ТипWSПараметра);
	СегоднешняяДата.On_date = ТекущаяДата();
	КурсыВалют = Соединение.GetCursOnDate(СегоднешняяДата);
	НовыйДок  = Документы.УстановкаКурсаВалют.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
		НайденнаяВалюта = Справочники.Валюты.НайтиПоКоду(Элемент.Vcode);
		ПроверкаНаличияВалютыВРегистреКурсыВалют =  ПроверкаДублейВРегистреКурсыВалют(НайденнаяВалюта,ТекущаяДата());
	Если ПроверкаНаличияВалютыВРегистреКурсыВалют Тогда 
			Продолжить;
		КонецЕсли;	
		Если ЗагрузитьВалюты Тогда
			Если ЗначениеЗаполнено(НайденнаяВалюта) Тогда 
				НоваяСтрока = НовыйДок.Курсы.Добавить();
				НоваяСтрока.Валюта = НайденнаяВалюта;	
				НоваяСтрока.Номинал  = Число(Элемент.Vnom);
				НоваяСтрока.Курс   = Элемент.Vcurs;	
			Иначе
				НовыйСправочник = Справочники.Валюты.СоздатьЭлемент();
				НовыйСправочник.Наименование = Элемент.Vname;
				НовыйСправочник.Код = Элемент.Vcode;
				НовыйСправочник.КодСимвольный =  Элемент.VchCode;
				НовыйСправочник.Записать();
				
				НоваяСтрока = НовыйДок.Курсы.Добавить();
				НоваяСтрока.Валюта = НовыйСправочник.Ссылка;		
				НоваяСтрока.Курс   = Элемент.Vcurs;	
			КонецЕсли;		
		Иначе
			Если ЗначениеЗаполнено(НайденнаяВалюта) Тогда 
				НоваяСтрока = НовыйДок.Курсы.Добавить();
				НоваяСтрока.Валюта = НайденнаяВалюта;	
				НоваяСтрока.Номинал  = Число(Элемент.Vnom);
				НоваяСтрока.Курс   = Элемент.Vcurs;	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "курс валют загружен! создан документ: "+ Строка(НовыйДок.Ссылка);
	Сообщение.КлючДанных =  НовыйДок.Ссылка ;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.Сообщить();	
КонецПроцедуры	