
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РаботникиОрганизаций.Очистить();
	Движения.РаботникиОрганизаций.Записать();
	
	//Ресурсы = ПроверкаДокументов.ПолучитьРесурсыСотрудника(Сотрудник, Подразделение, МоментВремени());
	//
	//Если Ресурсы.Состояние<>Перечисления.СостоянияРаботников.Работает Тогда
	//              
	//	Сообщить("Сотрудник здесь не работает");
	//	Отказ = Истина;
	//	Возврат;
	//
	//КонецЕсли; 
	// регистр РаботникиОрганизаций
	Движения.РаботникиОрганизаций.Записывать = Истина;
	Движения.ПлановыеНачисления.Записывать = Истина;
	Движения.ПлановыеУдержания.Записывать = Истина;
	Движение = Движения.РаботникиОрганизаций.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Подразделение = Подразделение;
	Движение.Состояние = Перечисления.СостоянияРаботников.Уволен;


	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПлановыеНачисленияСрезПоследних.ВидРасчета КАК ВидРасчета
	//	|ИЗ
	//	|	РегистрСведений.ПлановыеНачисления.СрезПоследних(
	//	|			&Момент,
	//	|			Сотрудник = &Сотрудник
	//	|				И Подразделение = &Подразделение) КАК ПлановыеНачисленияСрезПоследних
	//	|ГДЕ
	//	|	ПлановыеНачисленияСрезПоследних.Значение <> 0
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПлановыеУдержанияСрезПоследних.ВидРасчета
	//	|ИЗ
	//	|	РегистрСведений.ПлановыеУдержания.СрезПоследних(
	//	|			&Момент,
	//	|			Сотрудник = &Сотрудник
	//	|				И Подразделение = &Подразделение) КАК ПлановыеУдержанияСрезПоследних
	//	|ГДЕ
	//	|	ПлановыеУдержанияСрезПоследних.Значение <> 0";

	//Запрос.УстановитьПараметр("Момент", МоментВремени());
	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда
	//	
	//		Запись = Движения.ПлановыеНачисления.Добавить();
	//		
	//	ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
	//		
	//		Запись = Движения.ПлановыеУдержания.Добавить();
	//		
	//	Иначе
	//		
	//		Сообщить("Странный ВР");
	//		Продолжить;
	//	
	//	КонецЕсли; 
	//	
	//	Запись.Период = Дата;
	//	Запись.Сотрудник = Сотрудник;
	//	Запись.Подразделение = Подразделение;
	//	Запись.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
	//	Запись.Значение = 0;
	//	
	//КонецЦикла;	
	
	
	//
	Движения.ПлановыеНачисления.Записывать = Истина;
	Движения.ПлановыеУдержания.Записывать = Истина;
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Дата", Дата);
	ДанныеДокумента.Вставить("Сотрудник", Сотрудник);
	ДанныеДокумента.Вставить("Подразделение", Подразделение);
	ДанныеДокумента.Вставить("МоментВремени", МоментВремени());
	
	КадровыйУчет.ОбнулитьПлановыеНачисленияУдержания(ДанныеДокумента, Движения);
	//

КонецПроцедуры
