
&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстанты()
	Возврат Константы.РасчитатьСтоимостьАвтоматически.Получить();
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСтоимостьАвтоматически = ПолучитьЗначениеКонстанты();	
	Если РасчитатьСтоимостьАвтоматически = Истина  Тогда
		 Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.ЦенаПоступления * 
		 										   Элементы.Товары.ТекущиеДанные.Количество;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаша(Команда)
	Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
КонецПроцедуры
