
Процедура ОбработкаПроведения(Отказ, Режим)
	

	// регистр ОстаткиНаСкладе2 Приход
	Движения.ОстаткиНаСкладе2.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНаСкладе2.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склады = Склад;
		Движение.Партия = Ссылка;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Стоимость;
	КонецЦикла;

КонецПроцедуры
