&НаКлиенте
Процедура ЗаполнитьМеню(Команда)
	
	Меню.Добавить("Борщ и Плов");
	Меню.Добавить("Суп и Картошка");
	Меню.Добавить("Харчо и Макароны");

КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицуЗначенийНаСервере()
	
	СтрокаТаблицы = ТаблицаМеню.Добавить();
	СтрокаТаблицы.Блюдо = "Борщ";
	СтрокаТаблицы.Вес = 300;
	СтрокаТаблицы.Стоимость = 30;
	
	СтрокаТаблицы = ТаблицаМеню.Добавить();
	СтрокаТаблицы.Блюдо = "Суп";
	СтрокаТаблицы.Вес = 300;
	СтрокаТаблицы.Стоимость = 20;
	
	СтрокаТаблицы = ТаблицаМеню.Добавить();
	СтрокаТаблицы.Блюдо = "Харчо";
	СтрокаТаблицы.Вес = 500;
	СтрокаТаблицы.Стоимость = 40;
	
	ИтогСтоимости = ТаблицаМеню.Итог("Стоимость");
	Сообщить(ИтогСтоимости);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТаблицуЗначений(Команда)
	СоздатьТаблицуЗначенийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДеревоНаСервере()
	// дерево значений
	НовоеДерево = Новый ДеревоЗначений;
	НовоеДерево.Колонки.Добавить("Вид", Новый ОписаниеТипов("Строка"));
	НовоеДерево.Колонки.Добавить("Блюдо", Новый ОписаниеТипов("Строка"));
	НовоеДерево.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число"));
	НовоеДерево.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число"));
	
	СтрокаДерева = НовоеДерево.Строки.Добавить();
	СтрокаДерева.Вид = "Первые Блюда";
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Борщ";
	ПодчиненнаяСтрока.Вес = 300;
	ПодчиненнаяСтрока.Стоимость = 30;
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Суп";
	ПодчиненнаяСтрока.Вес = 300;
	ПодчиненнаяСтрока.Стоимость = 20;
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Харчо";
	ПодчиненнаяСтрока.Вес = 500;
	ПодчиненнаяСтрока.Стоимость = 40;
	
	СтрокаДерева = НовоеДерево.Строки.Добавить();
	СтрокаДерева.Вид = "Вторые Блюда";
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Картофельное пюре";
	ПодчиненнаяСтрока.Вес = 200;
	ПодчиненнаяСтрока.Стоимость = 10;
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Макароны";
	ПодчиненнаяСтрока.Вес = 100;
	ПодчиненнаяСтрока.Стоимость = 5;

	ЗначениеВДанныеФормы(НовоеДерево, ДеревоМеню);
КонецПроцедуры

&НаКлиенте
Процедура Дерево(Команда)
	ДеревоНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОбойтиСтроки(Строки)

	  Для каждого Строка Из Строки Цикл
	  
	  	Сообщить(Строка.Вид + " " + Строка.Блюдо);
	    ОбойтиСтроки(Строка.Строки)

	  КонецЦикла; 

КонецПроцедуры // ОбойтиСтроки()

&НаСервере
Процедура ОбойтиСтрокиНаФорме(Дерево)
		ЭлементыДерева=Дерево.ПолучитьЭлементы();

	  Для каждого Строка Из ЭлементыДерева Цикл
	  
	  	Сообщить(Строка.Вид + " " + Строка.Блюдо);
	    ОбойтиСтрокиНаФорме(Строка)

	  КонецЦикла; 

КонецПроцедуры // ОбойтиСтроки()
&НаСервере
Процедура ОбойтиДеревоНаСервере()
	
	// дерево значений
	НовоеДерево = Новый ДеревоЗначений;
	НовоеДерево.Колонки.Добавить("Вид", Новый ОписаниеТипов("Строка"));
	НовоеДерево.Колонки.Добавить("Блюдо", Новый ОписаниеТипов("Строка"));
	НовоеДерево.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число"));
	НовоеДерево.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число"));
	
	СтрокаДерева = НовоеДерево.Строки.Добавить();
	СтрокаДерева.Вид = "Первые Блюда";
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Борщ";
	ПодчиненнаяСтрока.Вес = 300;
	ПодчиненнаяСтрока.Стоимость = 30;
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Суп";
	ПодчиненнаяСтрока.Вес = 300;
	ПодчиненнаяСтрока.Стоимость = 20;
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Харчо";
	ПодчиненнаяСтрока.Вес = 500;
	ПодчиненнаяСтрока.Стоимость = 40;
	
	СтрокаДерева = НовоеДерево.Строки.Добавить();
	СтрокаДерева.Вид = "Вторые Блюда";
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Картофельное пюре";
	ПодчиненнаяСтрока.Вес = 200;
	ПодчиненнаяСтрока.Стоимость = 10;
	ПодчиненнаяСтрока =  СтрокаДерева.Строки.Добавить();
	ПодчиненнаяСтрока.Блюдо = "Макароны";
	ПодчиненнаяСтрока.Вес = 100;
	ПодчиненнаяСтрока.Стоимость = 5;
	
	Строки =  НовоеДерево.Строки;
	ОбойтиСтроки(Строки) ;
	
	ОбойтиСтрокиНаФорме(ДеревоМеню);		


КонецПроцедуры

&НаКлиенте
Процедура ОбойтиДерево(Команда)
	ОбойтиДеревоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьПроцедуруМодуляНаСервере()
	Справочники.Контрагенты.ЧастноеЛицо.ПолучитьОбъект().СозданиеДубля();
	Справочники.Контрагенты.СозданиеДубляМодульМенеджера();;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПроцедуруМодуля(Команда)
	ПроверитьПроцедуруМодуляНаСервере();
КонецПроцедуры
