&НаСервере
Функция ПолучитьЗначениеКонстантыРасчетСтоимости()
	ДаНет = Константы.РасчитатьСтоимостьАвтоматически.Получить();
	Возврат ДаНет;
КонецФункции	
&НаСервереБезКонтекста
Функция ТоварыПриАктивизацииСтрокиНаСервере(СтруктураДанных,Товар)
	Отбор  = Новый Структура("Номенклатура,Склады",Товар,СтруктураДанных.Склады ); 
	НаДату=СтруктураДанных.Дата;
	Если ЗначениеЗаполнено(НаДату) Тогда
		
		//Таблица =РегистрыНакопления.ОстаткиТоваров.Остатки(Дата,Отбор);
		Граница = Новый Граница (НаДату, ВидГраницы.Включая);
		
		Таблица =РегистрыНакопления.ОстаткиНаСкладе.Остатки(Граница,Отбор);
		
	Иначе
	Таблица =РегистрыНакопления.ОстаткиНаСкладе.Остатки(,Отбор);
	
	КонецЕсли; 
	Возврат Таблица.Итог("Количество");
КонецФункции

&НаСервере
Функция ПолучитьЦену(Товар,Дата,Склад)
	Цена = 0;
	Цена = ОбщееНазначение.ПолучитьЦенуТовара(Товар,Дата,Склад.Оптовый);
	//Цена = Товар.Цена;
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЦеныТоваровСрезПоследних.Цена КАК Цена
	//|ИЗ
	//|	РегистрСведений.ЦеныТоваров.СрезПоследних(&НаДату, Товар = &Товар) КАК ЦеныТоваровСрезПоследних";
	//
	//Запрос.УстановитьПараметр("НаДату", Дата);
	//Запрос.УстановитьПараметр("Товар", Товар);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Цена = ВыборкаДетальныеЗаписи.Цена;	
	//КонецЦикла;
	
	//Отбор = новый структура("Товар",Товар) ;
	//Цена = РегистрыСведений.ЦеныТоваров.ПолучитьПоследнее(Дата,Отбор).Цена;
	Возврат Цена;	

КонецФункции	
&НаКлиенте
Процедура РасчетСумму()
	РасчитатьСтоимость = ПолучитьЗначениеКонстантыРасчетСтоимости();
	Если РасчитатьСтоимость Тогда 
		Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;
	КонецЕсли;
КонецПроцедуры	
&НаКлиенте
Процедура РасчетСтоимости(Элемент)
	РасчетСумму();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтоимостьПриИзменении(Элемент)
	СтоимостьСкидка = ОбщееНазначение.РасчитатьСтоимостьСкидку(Элементы.Товары.ТекущиеДанные.Количество,Элементы.Товары.ТекущиеДанные.ЦенаРеалиации);
	Элементы.Товары.ТекущиеДанные.Стоимость = СтоимостьСкидка[0];
	Элементы.Товары.ТекущиеДанные.Скидка = СтоимостьСкидка[1];
	Элементы.Товары.ТекущиеДанные.СтомостьСоСкидкой =СтоимостьСкидка[2];
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	Если Элементы.Товары.ТекущаяСтрока<> Неопределено Тогда
		ТД = Элементы.товары.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
			СтруктураДанных=Новый Структура;
			СтруктураДанных.Вставить("Дата",Объект.Дата);
			СтруктураДанных.Вставить("Склады",Объект.Склад);
			Остаток =ТоварыПриАктивизацииСтрокиНаСервере(СтруктураДанных,ТД.Номенклатура);
		Иначе
			Остаток =0;
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	Цена = ПолучитьЦену(ТД.Номенклатура,объект.Дата,Объект.Склад);
	ТД.ЦенаРеализации = Цена;
	
	РасчетСумму();
	Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
		 СтруктураДанных = Новый Структура;
		 СтруктураДанных.Вставить("Дата",Объект.Дата);
		 СтруктураДанных.Вставить("Склады",Объект.Склад);
		 
		 Остаток = ТоварыПриАктивизацииСтрокиНаСервере(СтруктураДанных,ТД.Номенклатура);
	КонецЕсли;	
КонецПроцедуры
