
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого ЭлементМассива из ПараметрКоманды Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Контрагент",ПолучитьКонтрагента(ЭлементМассива));
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор",Отбор);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
		ОткрытьФорму("Отчет.ИсторияКонтрагента.Форма",ПараметрыФормы,,Истина);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагента(ТекДоговор)
	 Возврат ТекДоговор.Владелец;
КонецФункции	