&НаСервере
Процедура ЗаполнитьВалюту()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьВалюту();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры	
&НаКлиенте
Процедура СчетОрганизацииПриИзменении(Элемент)
	ЗаполнитьВалюту();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьВалютнуюСумму()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьВалютнуюСумму(Объект.Сумма);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры	
&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ЗаполнитьВалютнуюСумму();
КонецПроцедуры
