Функция ФамилияИИнициалы(СтруктураДанных)
	 Возврат СтруктураДанных.Фамилия + " "+Сред(СтруктураДанных.Имя,1,1)+". "+Сред(СтруктураДанных.Отчество,1,1+". ");
КонецФункции	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет = Обработки.РаботаСПримитивнымиТипамиКолекциями.ПолучитьМакет("Макет");
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(Макет.ПолучитьДокументHTML(), ЗаписьHTML);
	ПолеHTML = ЗаписьHTML.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКнопка(Команда)
	// 1.
	Сообщить("1.");
	СтрокаИсходная = "Всем12Привет59И5Хорошего459Дня";
	СтрокаПроверки = "0123456789";
	Сообщить(СтрокаИсходная);
	СтрРезультат = "";
	ДлинаСтроки = СтрДлина("Исходная строка: "+СтрокаИсходная);
	//Первый способ
	Для Сч = 1 По ДлинаСтроки Цикл
		// Сред(<Строка>, <НачальныйНомер>, <ЧислоСимволов>)
		// Выбирает строку символов, начиная с символа <НачальныйНомер>, 
		//общим количеством <ЧислоСимволов>.
		ТекущийСимвол = Сред(СтрокаИсходная,Сч,1);
		// Найти(<Строка>, <ПодстрокаПоиска>)
		// Функция является устаревшей! Рекомендуется использовать функцию СтрНайти.
		//Находит первое вхождение искомой строки как подстроки в исходной строке. 
		//Сравнение выполняется с учетом регистра.
		Если Найти(СтрокаПроверки,ТекущийСимвол)>0 Тогда 
			СтрРезультат = СтрРезультат+ТекущийСимвол;
		КонецЕсли;	
	КонецЦикла;
	Сообщить("Первый способ "+СтрРезультат);
	//второй способ
	СтрРезультат = "";
	Для Сч = 1 По ДлинаСтроки Цикл
		//Сред(<Строка>, <НачальныйНомер>, <ЧислоСимволов>)
		//Выбирает строку символов, начиная с символа <НачальныйНомер>, 
		//общим количеством <ЧислоСимволов>.
		Цифра = Сред(СтрокаИсходная,Сч,1);
		//КодСимвола(<Строка>, <НомерСимвола>)
		//Получает код символа, расположенного в переданной строке в позиции с указанным номером.
		КодСимвола = КодСимвола(Цифра);
		
		Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			 СтрРезультат = СтрРезультат + Цифра;
		КонецЕсли;	
	КонецЦикла;	
	Сообщить("второй способ " + СтрРезультат);
	//2.
	Сообщить("2.");
	ЧислоСДробнойЧастью = 126.28;
	ЦелаяЧасть = Цел(ЧислоСДробнойЧастью);
	ДробнаяЧасть = ЧислоСДробнойЧастью - ЦелаяЧасть;
	Сообщить("Дробная часть от числа "+ЧислоСДробнойЧастью+" на дробную часть "+ДробнаяЧасть);
	
	//3.
	Сообщить("3.");
	ДатаДляРасчета = ТекущаяДата();
	Сообщить("Заданная дата"+ДатаДляРасчета);
	ДатаЧерез20Дней = ДатаДляРасчета + 86400*20;
	Сообщить("Через 20 дней будет: "+ДатаЧерез20Дней);
	
	// 5.
	Сообщить("5.");
	Родственники = Новый Соответствие();
	Родственники.Вставить("Муж Петр",Дата(1966,10,31));
	Родственники.Вставить("Сын Игорь",Дата(1993,10,27));
	Родственники.Вставить("Невестка Надежда",Дата(1993,10,08));
	Для Каждого ЭлементСоответствия из Родственники Цикл
		 Сообщить("Родственники [" +
    	 		   Строка(ЭлементСоответствия.Ключ) + "] = " +
    			   ЭлементСоответствия.Значение);
	КонецЦикла;	

	

	//6.
	Сообщить("6.");
	НоваяСтруктура = Новый Структура;
	НоваяСтруктура.Вставить("Фамилия","Петренко");
	НоваяСтруктура.Вставить("Имя","Виктор");
	НоваяСтруктура.Вставить("Отчество","Иванович");
	Для Каждого Строка из НоваяСтруктура Цикл
		 Сообщить(Строка.Ключ + " "+Строка.Значение);
	КонецЦикла;	
	//7.
	Сообщить("7.");
	Сообщить(ФамилияИИнициалы(НоваяСтруктура));
	//8.
	ГинераторЧисел = Новый ГенераторСлучайныхЧисел(2);
	МассивЧисел =Новый Массив;
	Для сч = 0 По 19 Цикл
		МассивЧисел.Добавить(ГинераторЧисел.СлучайноеЧисло(Сч,100));
		Сообщить(МассивЧисел[Сч]);
	КонецЦикла; 
	Если МассивЧисел.Количество() > 0 Тогда
		МаксимальныйЭлемент = МассивЧисел[0];
		Для Сч =0 по 19 Цикл
			Если МассивЧисел[Сч]> МаксимальныйЭлемент Тогда
				МаксимальныйЭлемент = МассивЧисел[Сч];
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
	Сообщить("Максимальный элемент" + МаксимальныйЭлемент);
КонецПроцедуры

