
&НаСервереБезКонтекста
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура)
	 Возврат Номенклатура.ЦенаПоступления;
КонецФункции
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.ЦенаПоступления = ТоварыНоменклатураПриИзмененииНаСервере(Товар.номенклатура);
	Товар.Стоимость = ОбщееНазначение.РасчитатьСуммуТабличнойЧасти(Товар.Количество,Товар.ЦенаПоступления);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
    Товар.Стоимость = Товар.ЦенаПоступления * Товар.Количество;
КонецПроцедуры
